Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/M2354_v1.svd
       <register>
          <name>SYS_SRAMPC0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SYS_SRAMPC0</displayName>
          <description>SRAM Power Mode Control Register 0</description>
          <addressOffset>0xDC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRAM0PM0</name>
              <description>Bank0 SRAM Power Mode Select 0 (Write Protect)\nThis field can control bank0 sram0 (4k) power mode for range 0x2000_0000 - 0x2000_0FFF.\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: Write ignore when PCBUSY is 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM0PM1</name>
              <description>Bank0 SRAM Power Mode Select 1 (Write Protect)\nThis field can control bank0 sram1 (4k) power mode for range 0x2000_1000 - 0x2000_1FFF.\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: Write ignore when PCBUSY is 1.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM0PM2</name>
              <description>Bank0 SRAM Power Mode Select 2 (Write Protect)\nThis field can control bank0 sram2 (8k) power mode for range 0x2000_2000 - 0x2000_3FFF.\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: Write ignore when PCBUSY is 1.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM0PM3</name>
              <description>Bank0 SRAM Power Mode Select 3 (Write Protect)\nThis field can control bank0 sram3 (8k) power mode for range 0x2000_4000 - 0x2000_5FFF.\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: Write ignore when PCBUSY is 1.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM0PM4</name>
              <description>Bank0 SRAM Power Mode Select 4 (Write Protect)\nThis field can control bank0 sram4 (8k) power mode for range 0x2000_6000 - 0x2000_7FFF.\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: Write ignore when PCBUSY is 1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM1PM0</name>
              <description>Bank1 SRAM Power Mode Select 0 (Write Protect)\nThis field can control bank1 sram0 (16k) power mode for range 0x2000_8000 - 0x2000_BFFF.\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: Write ignore when PCBUSY is 1.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM1PM1</name>
              <description>Bank1 SRAM Power Mode Select 1 (Write Protect)\nThis field can control bank1 sram1 (16k) power mode for range 0x2000_C000 - 0x2000_FFFF.\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: Write ignore when PCBUSY is 1.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM1PM2</name>
              <description>Bank1 SRAM Power Mode Select 2 (Write Protect)\nThis field can control bank1 sram2 (16k) power mode for range 0x2001_0000 - 0x2001_3FFF.\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: Write ignore when PCBUSY is 1.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM1PM3</name>
              <description>Bank1 SRAM Power Mode Select 3 (Write Protect)\nThis field can control bank1 sram3 (16k) power mode for range 0x2001_4000 - 0x2001_7FFF.\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: Write ignore when PCBUSY is 1.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM1PM4</name>
              <description>Bank1 SRAM Power Mode Select 4 (Write Protect)\nThis field can control bank1 sram4 (16k) power mode for range 0x2001_8000 - 0x2001_BFFF.\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: Write ignore when PCBUSY is 1.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM1PM5</name>
              <description>Bank1 SRAM Power Mode Select 5 (Write Protect)\nThis field can control bank1 sram5 (16k) power mode for range 0x2001_C000 - 0x2001_FFFF.\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: Write ignore when PCBUSY is 1.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM1PM6</name>
              <description>Bank1 SRAM Power Mode Select 6 (Write Protect)\nThis field can control bank1 sram6 (16k) power mode for range 0x2002_0000 - 0x2002_3FFF.\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: Write ignore when PCBUSY is 1.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM1PM7</name>
              <description>Bank1 SRAM Power Mode Select 7 (Write Protect)\nThis field can control bank1 sram7 (16k) power mode for range 0x2002_4000 - 0x2002_7FFF.\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: Write ignore when PCBUSY is 1.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM2PM0</name>
              <description>Bank2 SRAM Power Mode Select 0 (Write Protect)\nThis field can control bank2 sram0 (16k) power mode for range 0x2002_8000 - 0x2002_BFFF.\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: Write ignore when PCBUSY is 1.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM2PM1</name>
              <description>Bank2 SRAM Power Mode Select 1 (Write Protect)\nThis field can control bank2 sram1 (16k) power mode for range 0x2002_C000 - 0x2002_FFFF.\nNote 1: These bits are write protected. Refer to the SYS_REGLCTL register.\nNote 2: Write ignore when PCBUSY is 1.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Normal mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Retention mode</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Power shut down mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Reserved (Write Ignore)</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PCBUSY</name>
              <description>Power Changing Busy Flag (Read Only)\nThis bit indicate SRAM power changing. </description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>SRAM power change finish</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SRAM power changing</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
