Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/M2354_v1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DPM</name>
      <description>SCU Register Map</description>
      <groupName>SCU</groupName>
      <baseAddress>0x4002F600</baseAddress>
      <!-- d -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x50</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x60</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>DPM_CTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>DPM_CTL</displayName>
          <description>Secure DPM Control Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <resetValue>0xA5000000</resetValue>
          <resetMask>0xFFFFFFF0</resetMask>
          <fields>
            <field>
              <name>DBGDIS</name>
              <description>Set Secure DPM Debug Disable Bit\nWhen this bit is read as 0, it can be written to 1 to configure the Secure DPM DBGDIS bit (DBGDISS).\nWhen written:\nNote: This bit can be set to 1 but cannot be cleared to 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Trigger the process to set DBGDISS configuration bit</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK</name>
              <description>Set Secure DPM Debug Lock Bit\nWhen this bit is read as 0, it can be written to 1 to configure the Secure DPM LOCK bit (LOCKS).\nWhen written:\nNote: This bit can be set to 1 but cannot be cleared to 0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Trigger the process to set LOCKS configuration bit</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PWCMP</name>
              <description>Secure DPM Password Compare Bit\nSet to enter the process of compare Secure DPM password.\nNote: This bit will be cleared after the comparison process is finished.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Compare Secure DPM password</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PWUPD</name>
              <description>Secure DPM Password Update Bit\nSet to enter the process of updating Secure DPM password.\nNote 1: This bit should be set with PWCMP equal to 0.\nNote 2: This bit will be cleared after the update process is finished.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Update Secure DPM password</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>INTEN</name>
              <description>DPM Interrupt Enable Bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>DPM interrupt function Enabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>DPM interrupt function Disabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DACCWDIS</name>
              <description>Secure DPM Debug Write Access Disable Bit\nThis bit disables the ability of external debugger to set Secure DPM registers for debug authentication. </description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>External debugger can set Secure DPM registers</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>External debugger cannot set Secure DPM registers</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DACCDIS</name>
              <description>Debug Access Disable Bit\nThis bit disables the accessibility of external debugger to all DPM registers.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>External debugger can read/write DPM registers</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>External debugger cannot read/write DPM registers</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RWVCODE</name>
              <description>Write Verify Code and Read Verify Code\nRead operation:</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>90</name>
                    <description>The write verify code, 0x5A, is needed to do a valid write to DPM_CTL</description>
                    <value>0x5a</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>165</name>
                    <description>The read access for DPM_CTL is correct</description>
                    <value>0xa5</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>DPM_STS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>DPM_STS</displayName>
          <description>Secure DPM Status Register</description>
          <addressOffset>0x4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFF0F0FF</resetMask>
          <fields>
            <field>
              <name>BUSY</name>
              <description>DPM Busy Flag (Read Only)\nThis bit indicates the DPM is busy.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>DPM is not busy and writing to any register is accepted</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>DPM is busy and other bits in DPM_STS register are not valid and writing to any register is ignored</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>INT</name>
              <description>DPM Interrupt Flag (Read Only)\nThis bit indicates the interrupt is triggered.\nNote: This bit is cleared automatically when PWCERR flag in both DPM_STS and DPM_NSSTS are 0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Interrupt is not enabled or no password comparison flag is set</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Interrupt is enabled and PWCERR flag in either DPM_STS or DPM_NSSTS register is not cleared</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>PWCERR</name>
              <description>Secure DPM Password Compared Error Flag\nThis bit indicates the result of Secure DPM password comparison.\nWhen read:\nNote: This flag is write-one-clear.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The result of Secure DPM password is correct</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The result of Secure DPM password is incorrect</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PWUOK</name>
              <description>Secure DPM Password Updated Flag\nThis bit indicates Secure DPM password has been updated successfully.\nWhen read:\nNote: This flag is write-one-clear.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No successful updating process has happened</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>There is at least one successful updating process since last clearing of this bit</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PWFMAX</name>
              <description>Secure DPM Password Fail Times Maximum Reached Flag (Read Only)\nThis bit indicates if the fail times of comparing Secure DPM password reached max times.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Max time has not reached and Secure DPM password comparison can be triggered</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Max time reached and Secure DPM password comparison cannot be processed anymore</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>PWUCNT</name>
              <description>Secure DPM Password Updated Times (Read Only)\nThis bit indicates how many times of secure password has been updated.\nThe max value is 7. If PWUCNT reached the max value, Secure DPM password cannot be updated anymore.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DBGDIS</name>
              <description>Secure Debug Disable Flag (Read Only)\nThis bit indicates the current value of DBGDISS bit.\n{PWOK, LOCK, DBGDIS} bits define the current state of DPM.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>DEFAULT state.\nLOCKED state</description>
                    <value>#000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>CLOSE state</description>
                    <value>#001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>OPEN state</description>
                    <value>#101</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>LOCK</name>
              <description>Secure Debug Lock Flag (Read Only)\nThis bit indicates the current value of LOCKS bit.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PWOK</name>
              <description>Secure Password OK Flag (Read Only)\nThis bit indicates the Secure DPM password has been checked and is correct.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The Secure DPM password has not been checked pass, yet</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The Secure DPM password has been checked pass since last cold reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>DPM_SPW0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>DPM_SPW0</displayName>
          <description>Secure DPM Password 0</description>
          <addressOffset>0x10</addressOffset>
          <access>write-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PW</name>
              <description>Password\nWrite password[31:0] to this register to update or compare Secure DPM password. It is write-only and always read as 0xFFFFFFFF.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>DPM_SPW1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>DPM_SPW1</displayName>
          <description>Secure DPM Password 1</description>
          <addressOffset>0x14</addressOffset>
          <access>write-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PW</name>
              <description>Password\nWrite password[63:32] to this register to update or compare Secure DPM password. It is write-only and always read as 0xFFFFFFFF.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>DPM_SPW2</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>DPM_SPW2</displayName>
          <description>Secure DPM Password 2</description>
          <addressOffset>0x18</addressOffset>
          <access>write-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PW</name>
              <description>Password\nWrite password[95:64] to this register to update or compare Secure DPM password. It is write-only and always read as 0xFFFFFFFF.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>DPM_SPW3</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>DPM_SPW3</displayName>
          <description>Secure DPM Password 3</description>
          <addressOffset>0x1C</addressOffset>
          <access>write-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PW</name>
              <description>Password\nWrite password[127:96] to this register to update or compare Secure DPM password. It is write-only and always read as 0xFFFFFFFF.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
       </register>
