Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/M2354_v1.svd
       <register derivedFrom="SCU_APB0VSRC">
          <name>SCU_SCUVSRC</name>
          <displayName>SCU_SCUVSRC</displayName>
          <description>SCU Security Policy Violation Source</description>
          <addressOffset>0xA4</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0VA">
          <name>SCU_SCUVA</name>
          <displayName>SCU_SCUVA</displayName>
          <description>SCU Violation Address</description>
          <addressOffset>0xA8</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0VSRC">
          <name>SCU_SYSVSRC</name>
          <displayName>SCU_SYSVSRC</displayName>
          <description>System Security Policy Violation Source</description>
          <addressOffset>0xAC</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0VA">
          <name>SCU_SYSVA</name>
          <displayName>SCU_SYSVA</displayName>
          <description>System Violation Address</description>
          <addressOffset>0xB0</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0VSRC">
          <name>SCU_CRPTVSRC</name>
          <displayName>SCU_CRPTVSRC</displayName>
          <description>Crypto Security Policy Violation Source</description>
          <addressOffset>0xB4</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0VA">
          <name>SCU_CRPTVA</name>
          <displayName>SCU_CRPTVA</displayName>
          <description>Crypto Violation Address</description>
          <addressOffset>0xB8</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0VSRC">
          <name>SCU_KSVSRC</name>
          <displayName>SCU_KSVSRC</displayName>
          <description>KS Security Policy Violation Source</description>
          <addressOffset>0xBC</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0VA">
          <name>SCU_KSVA</name>
          <displayName>SCU_KSVA</displayName>
          <description>KS Violation Address</description>
          <addressOffset>0xC0</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0VSRC">
          <name>SCU_SRAM2VSRC</name>
          <displayName>SCU_SRAM2VSRC</displayName>
          <description>SRAM2 Security Policy Violation Source</description>
          <addressOffset>0xC4</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0VA">
          <name>SCU_SRAM2VA</name>
          <displayName>SCU_SRAM2VA</displayName>
          <description>SRAM2 Violation Address</description>
          <addressOffset>0xC8</addressOffset>
       </register>
       <register>
          <name>SCU_SINFAEN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SCU_SINFAEN</displayName>
          <description>Shared Information Access Enable Register</description>
          <addressOffset>0xF0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000007</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCUSIAEN</name>
              <description>SCU Shared Information Access Enable Bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Non-secure CPU access SCU Shared information Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Non-secure CPU access SCU Shared information Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSSIAEN</name>
              <description>SYS Shared Information Access Enable Bit\nNote: Include clock information.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Non-secure CPU access SYS Shared information Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Non-secure CPU access SYS Shared information Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>FMCSIAEN</name>
              <description>FMC Shared Information Access Enable Bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Non-secure CPU access FMC Shared information Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Non-secure CPU access FMC Shared information Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SCU_PNPSET0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SCU_PNPSET0</displayName>
          <description>Peripheral Non-privileged Attribution Set Register0 (0x4000_0000~0x4001_FFFF)</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SYS</name>
              <description>Set SYS to Non-privileged State</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>SYS is a privileged module (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SYS is a non-privileged module</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PDMA0</name>
              <description>Set PDMA0 to Non-privileged State</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PDMA0 is a privileged module (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PDMA0 is a non-privileged module</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>USBH</name>
              <description>Set USBH to Non-privileged State</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>USBH is a privileged module (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>USBH is a non-privileged module</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>FMC</name>
              <description>Set FMC to Non-privileged State</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>FMC is a privileged module (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>FMC is a non-privileged module</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SDH0</name>
              <description>Set SDH0 to Non-privileged State</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>SDH0 is a privileged module (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SDH0 is a non-privileged module</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>EBI</name>
              <description>Set EBI to Non-privileged State</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>EBI is a privileged module (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>EBI is a non-privileged module</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PDMA1</name>
              <description>Set PDMA1 to Non-privileged State</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PDMA1 is a privileged module (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PDMA1 is a non-privileged module</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SCU_PNPSET1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SCU_PNPSET1</displayName>
          <description>Peripheral Non-privileged Attribution Set Register1 (0x4002_0000~0x4003_FFFF)</description>
          <addressOffset>0x104</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCU</name>
              <description>Set SCU to Non-privileged State</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>SCU is a privileged module (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SCU is a non-privileged module</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CRC</name>
              <description>Set CRC to Non-privileged State</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>CRC is a privileged module (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>CRC is a non-privileged module</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CRPT</name>
              <description>Set CRPT to Non-privileged State</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>CRPT is a privileged module (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>CRPT is a non-privileged module</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>KS</name>
              <description>Set KS to Non-privileged State</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>KS is a privileged module (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>KS is a non-privileged module</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
