Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/M2354_v1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PH</name>
      <description>GPIO Register Map</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x400049C0</baseAddress>
      <!-- d -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x40</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>PH0_PDIO</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PH0_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFF0</resetMask>
          <fields>
            <field>
              <name>PDIO</name>
              <description>GPIO Px.n Pin Data Input/Output\nWriting this bit can control one GPIO pin output value.\nRead this register to get GPIO pin status.\nFor example, writing PA0_PDIO will reflect the written value to bit DOUT (PA_DOUT[0]), reading PA0_PDIO will return the value of PIN (PA_PIN[0]).\nNote 1: The writing operation will not be affected by register DATMSK (Px_DATMSK[n]).\nNote 2: The PC.14/PC.15/ PD.13/ PD.15/ PF.12~15/ PG.0/ PG.1/ PG.5~8/ PH.0~3/ PH.12~15 pin is ignored.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Corresponding GPIO pin set to low</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Corresponding GPIO pin set to high</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH1_PDIO</name>
          <displayName>PH1_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x4</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH2_PDIO</name>
          <displayName>PH2_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x8</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH3_PDIO</name>
          <displayName>PH3_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0xC</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH4_PDIO</name>
          <displayName>PH4_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x10</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH5_PDIO</name>
          <displayName>PH5_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x14</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH6_PDIO</name>
          <displayName>PH6_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x18</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH7_PDIO</name>
          <displayName>PH7_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x1C</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH8_PDIO</name>
          <displayName>PH8_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x20</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH9_PDIO</name>
          <displayName>PH9_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x24</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH10_PDIO</name>
          <displayName>PH10_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x28</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH11_PDIO</name>
          <displayName>PH11_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x2C</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH12_PDIO</name>
          <displayName>PH12_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x30</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH13_PDIO</name>
          <displayName>PH13_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x34</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH14_PDIO</name>
          <displayName>PH14_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x38</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH15_PDIO</name>
          <displayName>PH15_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x3C</addressOffset>
       </register>
