Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/M2354_v1.svd
       <register derivedFrom="PDMAx_DSCT0_DA">
          <name>PDMAx_DSCT1_DA</name>
          <displayName>PDMAx_DSCT1_DA</displayName>
          <description>Destination Address Register of PDMA Channel n</description>
          <addressOffset>0x18</addressOffset>
       </register>
       <register derivedFrom="PDMAx_DSCT0_DA">
          <name>PDMAx_DSCT2_DA</name>
          <displayName>PDMAx_DSCT2_DA</displayName>
          <description>Destination Address Register of PDMA Channel n</description>
          <addressOffset>0x28</addressOffset>
       </register>
       <register derivedFrom="PDMAx_DSCT0_DA">
          <name>PDMAx_DSCT3_DA</name>
          <displayName>PDMAx_DSCT3_DA</displayName>
          <description>Destination Address Register of PDMA Channel n</description>
          <addressOffset>0x38</addressOffset>
       </register>
       <register derivedFrom="PDMAx_DSCT0_DA">
          <name>PDMAx_DSCT4_DA</name>
          <displayName>PDMAx_DSCT4_DA</displayName>
          <description>Destination Address Register of PDMA Channel n</description>
          <addressOffset>0x48</addressOffset>
       </register>
       <register derivedFrom="PDMAx_DSCT0_DA">
          <name>PDMAx_DSCT5_DA</name>
          <displayName>PDMAx_DSCT5_DA</displayName>
          <description>Destination Address Register of PDMA Channel n</description>
          <addressOffset>0x58</addressOffset>
       </register>
       <register derivedFrom="PDMAx_DSCT0_DA">
          <name>PDMAx_DSCT6_DA</name>
          <displayName>PDMAx_DSCT6_DA</displayName>
          <description>Destination Address Register of PDMA Channel n</description>
          <addressOffset>0x68</addressOffset>
       </register>
       <register derivedFrom="PDMAx_DSCT0_DA">
          <name>PDMAx_DSCT7_DA</name>
          <displayName>PDMAx_DSCT7_DA</displayName>
          <description>Destination Address Register of PDMA Channel n</description>
          <addressOffset>0x78</addressOffset>
       </register>
       <register>
          <name>PDMAx_DSCT0_NEXT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMAx_DSCT0_NEXT</displayName>
          <description>Next Scatter-gather Descriptor Table Offset Address of PDMA Channel n</description>
          <addressOffset>0xC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>NEXT</name>
              <description>PDMA Next Descriptor Table Offset\nThis field indicates the offset of the next descriptor table address in system memory. \nWrite Operation:\nIf the system memory based address is 0x2000_0000 (PDMA_SCATBA), and the next descriptor table is start from 0x2000_0100, then this field must fill in 0x0100.\nRead Operation:\nWhen operating in Scatter-gather mode, the last two bits NEXT[1:0] will become reserved, and indicate the first next address of system memory.\nNote 1: The descriptor table address must be word boundary.\nNote 2: Before filling transfer task in the descriptor table, user must check if the descriptor table is complete.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXENEXT</name>
              <description>PDMA Execution Next Descriptor Table Offset\nThis field indicates the offset of next descriptor table address of current execution descriptor table in system memory. \nNote: Write operation is useless in this field.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="PDMAx_DSCT0_NEXT">
          <name>PDMAx_DSCT1_NEXT</name>
          <displayName>PDMAx_DSCT1_NEXT</displayName>
          <description>Next Scatter-gather Descriptor Table Offset Address of PDMA Channel n</description>
          <addressOffset>0x1C</addressOffset>
       </register>
       <register derivedFrom="PDMAx_DSCT0_NEXT">
          <name>PDMAx_DSCT2_NEXT</name>
          <displayName>PDMAx_DSCT2_NEXT</displayName>
          <description>Next Scatter-gather Descriptor Table Offset Address of PDMA Channel n</description>
          <addressOffset>0x2C</addressOffset>
       </register>
       <register derivedFrom="PDMAx_DSCT0_NEXT">
          <name>PDMAx_DSCT3_NEXT</name>
          <displayName>PDMAx_DSCT3_NEXT</displayName>
          <description>Next Scatter-gather Descriptor Table Offset Address of PDMA Channel n</description>
          <addressOffset>0x3C</addressOffset>
       </register>
       <register derivedFrom="PDMAx_DSCT0_NEXT">
          <name>PDMAx_DSCT4_NEXT</name>
          <displayName>PDMAx_DSCT4_NEXT</displayName>
          <description>Next Scatter-gather Descriptor Table Offset Address of PDMA Channel n</description>
          <addressOffset>0x4C</addressOffset>
       </register>
       <register derivedFrom="PDMAx_DSCT0_NEXT">
          <name>PDMAx_DSCT5_NEXT</name>
          <displayName>PDMAx_DSCT5_NEXT</displayName>
          <description>Next Scatter-gather Descriptor Table Offset Address of PDMA Channel n</description>
          <addressOffset>0x5C</addressOffset>
       </register>
       <register derivedFrom="PDMAx_DSCT0_NEXT">
          <name>PDMAx_DSCT6_NEXT</name>
          <displayName>PDMAx_DSCT6_NEXT</displayName>
          <description>Next Scatter-gather Descriptor Table Offset Address of PDMA Channel n</description>
          <addressOffset>0x6C</addressOffset>
       </register>
       <register derivedFrom="PDMAx_DSCT0_NEXT">
          <name>PDMAx_DSCT7_NEXT</name>
          <displayName>PDMAx_DSCT7_NEXT</displayName>
          <description>Next Scatter-gather Descriptor Table Offset Address of PDMA Channel n</description>
          <addressOffset>0x7C</addressOffset>
       </register>
       <register>
          <name>PDMAx_CURSCAT0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMAx_CURSCAT0</displayName>
          <description>Current Scatter-gather Descriptor Table Address of PDMA Channel n</description>
          <addressOffset>0x80</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>CURADDR</name>
              <description>PDMA Current Description Address (Read Only)\nThis field indicates a 32-bit current external description address of PDMA controller.\nNote: This field is read only and used for Scatter-gather mode only to indicate the current external description address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
