Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/M2354_v1.svd
       <register derivedFrom="CRYPTO_AES_KEY0">
          <name>CRYPTO_AES_KEY1</name>
          <displayName>CRYPTO_AES_KEY1</displayName>
          <description>AES Key Word 1 Register</description>
          <addressOffset>0xC4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES_KEY0">
          <name>CRYPTO_AES_KEY2</name>
          <displayName>CRYPTO_AES_KEY2</displayName>
          <description>AES Key Word 2 Register</description>
          <addressOffset>0xC8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES_KEY0">
          <name>CRYPTO_AES_KEY3</name>
          <displayName>CRYPTO_AES_KEY3</displayName>
          <description>AES Key Word 3 Register</description>
          <addressOffset>0xCC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES_KEY0">
          <name>CRYPTO_AES_KEY4</name>
          <displayName>CRYPTO_AES_KEY4</displayName>
          <description>AES Key Word 4 Register</description>
          <addressOffset>0xD0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES_KEY0">
          <name>CRYPTO_AES_KEY5</name>
          <displayName>CRYPTO_AES_KEY5</displayName>
          <description>AES Key Word 5 Register</description>
          <addressOffset>0xD4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES_KEY0">
          <name>CRYPTO_AES_KEY6</name>
          <displayName>CRYPTO_AES_KEY6</displayName>
          <description>AES Key Word 6 Register</description>
          <addressOffset>0xD8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES_KEY0">
          <name>CRYPTO_AES_KEY7</name>
          <displayName>CRYPTO_AES_KEY7</displayName>
          <description>AES Key Word 7 Register</description>
          <addressOffset>0xDC</addressOffset>
       </register>
       <register>
          <name>CRYPTO_AES_IV0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_AES_IV0</displayName>
          <description>AES Initial Vector Word 0 Register</description>
          <addressOffset>0xE0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IV</name>
              <description>AES Initial Vectors\nFour initial vectors (CRYPTO_AES_IV0, CRYPTO_AES_IV1, CRYPTO_AES_IV2, and CRYPTO_AES_IV3) are for AES operating in CBC, CFB, and OFB mode. Four registers (CRYPTO_AES_IV0, CRYPTO_AES_IV1, CRYPTO_AES_IV2, and CRYPTO_AES_IV3) act as Nonce counter when the AES engine is operating in CTR mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_AES_IV0">
          <name>CRYPTO_AES_IV1</name>
          <displayName>CRYPTO_AES_IV1</displayName>
          <description>AES Initial Vector Word 1 Register</description>
          <addressOffset>0xE4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES_IV0">
          <name>CRYPTO_AES_IV2</name>
          <displayName>CRYPTO_AES_IV2</displayName>
          <description>AES Initial Vector Word 2 Register</description>
          <addressOffset>0xE8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES_IV0">
          <name>CRYPTO_AES_IV3</name>
          <displayName>CRYPTO_AES_IV3</displayName>
          <description>AES Initial Vector Word 3 Register</description>
          <addressOffset>0xEC</addressOffset>
       </register>
       <register>
          <name>CRYPTO_AES_SADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_AES_SADDR</displayName>
          <description>AES DMA Source Address Register</description>
          <addressOffset>0xF0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SADDR</name>
              <description>AES DMA Source Address\nThe AES accelerator supports DMA function to transfer the plain text between SRAM memory space and embedded FIFO. The SADDR keeps the source address of the data buffer where the source text is stored. Based on the source address, the AES accelerator can read the plain text (encryption) / cipher text (descryption) from SRAM memory space and do AES operation. The start of source address should be located at word boundary. In other words, bit 1 and 0 of SADDR are ignored.\nSADDR can be read and written. Writing to SADDR while the AES accelerator is operating does not affect the current AES operation. But the value of SADDR will be updated later on. Consequently, software can prepare the DMA source address for the next AES operation.\nIn DMA mode, software can update the next CRYPTO_AES_SADDR before triggering START.\nThe value of CRYPTO_AES_SADDR and CRYPTO_AES_DADDR can be the same.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_AES_DADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_AES_DADDR</displayName>
          <description>AES DMA Destination Address Register</description>
          <addressOffset>0xF4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DADDR</name>
              <description>AES DMA Destination Address\nThe AES accelerator supports DMA function to transfer the cipher text between SRAM memory space and embedded FIFO. The DADDR keeps the destination address of the data buffer where the engine output's text will be stored. Based on the destination address, the AES accelerator can write the cipher text (encryption) / plain text (decryption) back to SRAM memory space after the AES operation is finished. The start of destination address should be located at word boundary. In other words, bit 1 and 0 of DADDR are ignored.\nDADDR can be read and written. Writing to DADDR while the AES accelerator is operating does not affect the current AES operation. But the value of DADDR will be updated later on. Consequently, software can prepare the destination address for the next AES operation.\nIn DMA mode, software can update the next CRYPTO_AES_DADDR before triggering START. \nThe value of CRYPTO_AES_SADDR and CRYPTO_AES_DADDR can be the same.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_AES_CNT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_AES_CNT</displayName>
          <description>AES Byte Count Register</description>
          <addressOffset>0xF8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>AES Byte Count\nThe CRYPTO_AES_CNT keeps the byte count of source text that is for the AES engine operating in DMA mode. The CRYPTO_AES_CNT is 32-bit and the maximum of byte count is 4G bytes.\nCRYPTO_AES_CNT can be read and written. Writing to CRYPTO_AES_CNT while the AES accelerator is operating does not affect the current AES operation. But the value of CRYPTO_AES_CNT will be updated later on. Consequently, software can prepare the byte count of data for the next AES operation.\nAccording to CBC-CS1, CBC-CS2, and CBC-CS3 standard, the count of operation data must be more than 16 bytes. Operations that are qual or less than one block will output unexpected result.\nIn Non-DMA ECB, CBC, CFB, OFB, CTR, CCM and GCM mode, CRYPTO_AES_CNT must be set as byte count for the last block of data before feeding in the last block of data. In Non-DMA CBC-CS1, CBC-CS2, and CBC-CS3 mode, CRYPTO_AES_CNT must be set as byte count for the last two blocks of data before feeding in the last two blocks of data.\nIn AES GCM mode without DMA cascade function, the value of CRYPTO_AES_CNT is equal to the total value of {CRYPTO_AES_GCM_IVCNT1, CRYPTO_AES_GCM_IVCNT0}, {CRYPTO_AES_GCM_ACNT1, CRYPTO_AES_GCM_ACNT0} and {CRYPTO_AES_GCM_PCNT1, CRYPTO_AES_GCM_PCNT0}. \nIn AES GCM mode with DMA cascade function, the value of CRYPTO_AES_CNT represents the byte count of source text in this cascade function. Thus, the value of CRYPTO_AES_CNT is less than or equal to the total value of {CRYPTO_AES_GCM_IVCNT1, CRYPTO_AES_GCM_IVCNT0}, {CRYPTO_AES_GCM_ACNT1, CRYPTO_AES_GCM_ACNT0} and {CRYPTO_AES_GCM_PCNT1, CRYPTO_AES_GCM_PCNT0} and must be block alignment. \nIn AES CCM mode without DMA cascade function, the value of CRYPTO_AES_CNT is equal to the total value of {CRYPTO_AES_GCM_ACNT1, CRYPTO_AES_GCM_ACNT0} and {CRYPTO_AES_GCM_PCNT1, CRYPTO_AES_GCM_PCNT0}. \nIn AES CCM mode with DMA cascade function, the value of CRYPTO_AES_CNT represents the byte count of source text in this cascade function. Thus, the value of CRYPTO_AES_CNT is less than or equal to the total value of {CRYPTO_AES_GCM_ACNT1, CRYPTO_AES_GCM_ACNT0} and {CRYPTO_AES_GCM_PCNT1, CRYPTO_AES_GCM_PCNT0} and must be block alignment, except for the last block of plaintext or ciphertext.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_AES_KSCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_AES_KSCTL</displayName>
          <description>AES Key Control Register</description>
          <addressOffset>0xEC0</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NUM</name>
              <description>Read Key Number\nThe key number is sent to key store</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RSRC</name>
              <description>Read Key Source</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Key is read from registers CRYPTO_AESx_KEYx</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Key is read from key store</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
            <field>
              <name>RSSRC</name>
              <description>Read Key Store Source</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Key is read from the SRAM of key store</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Key is read from the OTP of key store</description>
                    <value>#10</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
          </fields>
       </register>
