Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/M2354_v1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ECC</name>
      <description>CRYPTO Register Map</description>
      <groupName>CRYPTO</groupName>
      <baseAddress>0x40032800</baseAddress>
      <!-- d -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x258</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x740</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>CRYPTO_ECC_CTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_CTL</displayName>
          <description>ECC Control Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>START</name>
              <description>ECC Accelerator Start\nNote: This bit is always 0 when it is read back.\nECC accelerator will ignore this START signal when BUSY flag is 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Start ECC accelerator. BUSY flag will be set</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>STOP</name>
              <description>ECC Accelerator Stop\nNote: This bit is always 0 when it is read back.\nRemember to clear ECC interrupt flag after stopping ECC accelerator.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Abort ECC accelerator and make it into idle state</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ECDSAS</name>
              <description>Generate S in ECDSA Signature Generation</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Formula for generating S</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ECDSAR</name>
              <description>Generate R in ECDSA Signature Generation</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Formula for generating R</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAEN</name>
              <description>ECC Accelerator DMA Enable Bit\nNote: Only when START and DMAEN are 1, ECC DMA engine will be active.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>ECC DMA engine Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>ECC DMA engine Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>FSEL</name>
              <description>Field Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Binary Field (GF(2m ))</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Prime Field (GF(p))</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ECCOP</name>
              <description>Point Operation for BF and PF\nBesides above three input data, point operations still need the parameters of elliptic curve (CURVEA, CURVEB, CURVEN and CURVEM) as shown in Figure 6.27-11.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Point multiplication</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Modulus operation : choose by MODOP (CRYPTO_ECC_CTL[12:11])</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Point addition</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Point doubling</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MODOP</name>
              <description>Modulus Operation for PF</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Division</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Multiplication :</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Addition</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Subtraction :</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CSEL</name>
              <description>Curve Selection</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>NIST suggested curve</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Montgomery curve</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAP</name>
              <description>Side-channel Attack Protection</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Full speed without side-channel protection</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Less speed with side-channel protection</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>LDP1</name>
              <description>The Control Signal of Register POINTX1 and POINTY1 for the x and Y Coordinate of the First Point </description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The register for POINTX1 and POINTY1 is not modified by DMA or user</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The register for POINTX1 and POINTY1 is modified by DMA or user</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>LDP2</name>
              <description>The Control Signal of Register POINTX2 and POINTY2 for the x and Y Coordinate of the Second Point</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The register for POINTX2 and POINTY2 is not modified by DMA or user</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The register for POINTX2 and POINTY2 is modified by DMA or user</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>LDA</name>
              <description>The Control Signal of Register for the Parameter CURVEA of Elliptic Curve</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The register for CURVEA is not modified by DMA or user</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The register for CURVEA is modified by DMA or user</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>LDB</name>
              <description>The Control Signal of Register for the Parameter CURVEB of Elliptic Curve </description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The register for CURVEB is not modified by DMA or user</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The register for CURVEB is modified by DMA or user</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>LDN</name>
              <description>The Control Signal of Register for the Parameter CURVEN of Elliptic Curve </description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The register for CURVEN is not modified by DMA or user</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The register for CURVEN is modified by DMA or user</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>LDK</name>
              <description>The Control Signal of Register for SCALARK </description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The register for SCALARK is not modified by DMA or user</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The register for SCALARK is modified by DMA or user</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CURVEM</name>
              <description>The key length of elliptic curve.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_ECC_STS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_STS</displayName>
          <description>ECC Status Register</description>
          <addressOffset>0x4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BUSY</name>
              <description>ECC Accelerator Busy Flag\nRemember to clear ECC interrupt flag after ECC accelerator finished</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The ECC accelerator is idle or finished</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The ECC accelerator is under processing and protects all registers</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>DMABUSY</name>
              <description>ECC DMA Busy Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>ECC DMA is idle or finished</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>ECC DMA is busy</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSERR</name>
              <description>ECC DMA Access Bus Error Flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Bus error will stop DMA operation and ECC accelerator</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>KSERR</name>
              <description>ECC Engine Access Key Store Error Flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Access error will stop ECC engine</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_ECC_X1_00</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_X1_00</displayName>
          <description>ECC the X-coordinate Word0 of the First Point</description>
          <addressOffset>0x8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>POINTX1</name>
              <description>ECC the X-coordinate Value of the First Point \nFor B-163 or K-163, POINTX1 is stored in CRYPTO_ECC_X1_00~CRYPTO_ECC_X1_05\nFor B-233 or K-233, POINTX1 is stored in CRYPTO_ECC_X1_00~CRYPTO_ECC_X1_07\nFor B-283 or K-283, POINTX1 is stored in CRYPTO_ECC_X1_00~CRYPTO_ECC_X1_08\nFor B-409 or K-409, POINTX1 is stored in CRYPTO_ECC_X1_00~CRYPTO_ECC_X1_12\nFor B-571 or K-571, POINTX1 is stored in CRYPTO_ECC_X1_00~CRYPTO_ECC_X1_17\nFor P-192, POINTX1 is stored in CRYPTO_ECC_X1_00~CRYPTO_ECC_X1_05\nFor P-224, POINTX1 is stored in CRYPTO_ECC_X1_00~CRYPTO_ECC_X1_06\nFor P-256, POINTX1 is stored in CRYPTO_ECC_X1_00~CRYPTO_ECC_X1_07\nFor P-384, POINTX1 is stored in CRYPTO_ECC_X1_00~CRYPTO_ECC_X1_11\nFor P-521, POINTX1 is stored in CRYPTO_ECC_X1_00~CRYPTO_ECC_X1_16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_01</name>
          <displayName>CRYPTO_ECC_X1_01</displayName>
          <description>ECC the X-coordinate Word1 of the First Point</description>
          <addressOffset>0xC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_02</name>
          <displayName>CRYPTO_ECC_X1_02</displayName>
          <description>ECC the X-coordinate Word2 of the First Point</description>
          <addressOffset>0x10</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_03</name>
          <displayName>CRYPTO_ECC_X1_03</displayName>
          <description>ECC the X-coordinate Word3 of the First Point</description>
          <addressOffset>0x14</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_04</name>
          <displayName>CRYPTO_ECC_X1_04</displayName>
          <description>ECC the X-coordinate Word4 of the First Point</description>
          <addressOffset>0x18</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_05</name>
          <displayName>CRYPTO_ECC_X1_05</displayName>
          <description>ECC the X-coordinate Word5 of the First Point</description>
          <addressOffset>0x1C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_06</name>
          <displayName>CRYPTO_ECC_X1_06</displayName>
          <description>ECC the X-coordinate Word6 of the First Point</description>
          <addressOffset>0x20</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_07</name>
          <displayName>CRYPTO_ECC_X1_07</displayName>
          <description>ECC the X-coordinate Word7 of the First Point</description>
          <addressOffset>0x24</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_08</name>
          <displayName>CRYPTO_ECC_X1_08</displayName>
          <description>ECC the X-coordinate Word8 of the First Point</description>
          <addressOffset>0x28</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_09</name>
          <displayName>CRYPTO_ECC_X1_09</displayName>
          <description>ECC the X-coordinate Word9 of the First Point</description>
          <addressOffset>0x2C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_10</name>
          <displayName>CRYPTO_ECC_X1_10</displayName>
          <description>ECC the X-coordinate Word10 of the First Point</description>
          <addressOffset>0x30</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_11</name>
          <displayName>CRYPTO_ECC_X1_11</displayName>
          <description>ECC the X-coordinate Word11 of the First Point</description>
          <addressOffset>0x34</addressOffset>
       </register>
