Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/M2354_v1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>HMAC</name>
      <description>CRYPTO Register Map</description>
      <groupName>CRYPTO</groupName>
      <baseAddress>0x40032300</baseAddress>
      <!-- d -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x130</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1FC</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC30</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>CRYPTO_HMAC_CTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_HMAC_CTL</displayName>
          <description>SHA/HMAC Control Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>START</name>
              <description>SHA/HMAC Engine Start\nNote: This bit is always 0 when it is read back.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Start SHA/HMAC engine. BUSY flag will be set</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>STOP</name>
              <description>SHA/HMAC Engine Stop\nNote: This bit is always 0 when it is read back.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Stop SHA/HMAC engine</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAFIRST</name>
              <description>SHA/HMAC First Block in Cascadefunction\nThis bit must be set as feeding in first byte of data.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMALAST</name>
              <description>SHA/HMAC Last Block\nThis bit must be set as feeding in last byte of data.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMACSCAD</name>
              <description>SHA/HMAC Engine DMA with Cascade Mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>DMA cascade function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>In DMA cascade mode, software can update DMA source address register, destination address register, and byte count register during a cascade operation, without finishing the accelerator operation</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAEN</name>
              <description>SHA/HMAC Engine DMA Enable Bit\nSHA/HMAC engine operates in DMA mode, and data movement from/to the engine is done by DMA logic.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>SHA/HMAC DMA engine Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SHA/HMAC DMA engine Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OPMODE</name>
              <description>SHA/HMAC Engine Operation Modes\n0x0xx: SHA1-160\n0x100: SHA2-256\n0x101: SHA2-224\n0x110: SHA2-512\n0x111: SHA2-384\nNote: These bits can be read and written, but writing to them would not take effect as BUSY is 1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HMACEN</name>
              <description>HMAC_SHA Engine Operating Mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Execute SHA function</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Execute HMAC function</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SM3EN</name>
              <description>SM3 Engine Enable Bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Execute other function</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Execute SM3 function</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>FBIN</name>
              <description>Feedback Input to SHA/HMAC Via DMA Automatically </description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Disable DMA automatical feedback input function</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Enable DMA automatical feedback input function when DMAEN = 1</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>FBOUT</name>
              <description>Feedback Output From SHA/HMAC Via DMA Automatically </description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Disable DMA automatical feedback output function</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Enable DMA automatical feedback output function when DMAEN = 1</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTSWAP</name>
              <description>SHA/HMAC Engine Output Data Swap</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Keep the original order</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The order that CPU feeds data to the accelerator will be changed from {byte3, byte2, byte1, byte0} to {byte0, byte1, byte2, byte3}</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>INSWAP</name>
              <description>SHA/HMAC Engine Input Data Swap</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Keep the original order</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The order that CPU feeds data to the accelerator will be changed from {byte3, byte2, byte1, byte0} to {byte0, byte1, byte2, byte3}</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_HMAC_STS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_HMAC_STS</displayName>
          <description>SHA/HMAC Status Flag</description>
          <addressOffset>0x4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BUSY</name>
              <description>SHA/HMAC Engine Busy </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>SHA/HMAC engine is idle or finished</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SHA/HMAC engine is busy</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>DMABUSY</name>
              <description>SHA/HMAC Engine DMA Busy Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>SHA/HMAC DMA engine is idle or finished</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SHA/HMAC DMA engine is busy</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>DMAERR</name>
              <description>SHA/HMAC Engine DMA Error Flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Show the SHA/HMAC engine access normal</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Show the SHA/HMAC engine access error</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>KSERR</name>
              <description>HMAC Engine Access Key Store Error Flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Access error will stop HMAC engine</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>DATINREQ</name>
              <description>SHA/HMAC Non-dMA Mode Data Input Request</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Request SHA/HMAC Non-DMA mode data input</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_HMAC_DGST0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_HMAC_DGST0</displayName>
          <description>SHA/HMAC Output Feedback Data 0</description>
          <addressOffset>0x8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DGST</name>
              <description>SHA/HMAC Output Feedback Data Output Register\nFor SHA-160, the digest is stored in CRYPTO_HMAC_DGST0 ~ CRYPTO_HMAC_DGST4.\nFor SHA-224, the digest is stored in CRYPTO_HMAC_DGST0 ~ CRYPTO_HMAC_DGST6.\nFor SHA-256, the digest is stored in CRYPTO_HMAC_DGST0 ~ CRYPTO_HMAC_DGST7.\nFor SHA-384, the digest is stored in CRYPTO_HMAC_DGST0 ~ CRYPTO_HMAC_DGST11.\nFor SHA-512, the digest is stored in CRYPTO_HMAC_DGST0 ~ CRYPTO_HMAC_DGST15.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST1</name>
          <displayName>CRYPTO_HMAC_DGST1</displayName>
          <description>SHA/HMAC Output Feedback Data 1</description>
          <addressOffset>0xC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST2</name>
          <displayName>CRYPTO_HMAC_DGST2</displayName>
          <description>SHA/HMAC Output Feedback Data 2</description>
          <addressOffset>0x10</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST3</name>
          <displayName>CRYPTO_HMAC_DGST3</displayName>
          <description>SHA/HMAC Output Feedback Data 3</description>
          <addressOffset>0x14</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST4</name>
          <displayName>CRYPTO_HMAC_DGST4</displayName>
          <description>SHA/HMAC Output Feedback Data 4</description>
          <addressOffset>0x18</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST5</name>
          <displayName>CRYPTO_HMAC_DGST5</displayName>
          <description>SHA/HMAC Output Feedback Data 5</description>
          <addressOffset>0x1C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST6</name>
          <displayName>CRYPTO_HMAC_DGST6</displayName>
          <description>SHA/HMAC Output Feedback Data 6</description>
          <addressOffset>0x20</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST7</name>
          <displayName>CRYPTO_HMAC_DGST7</displayName>
          <description>SHA/HMAC Output Feedback Data 7</description>
          <addressOffset>0x24</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST8</name>
          <displayName>CRYPTO_HMAC_DGST8</displayName>
          <description>SHA/HMAC Output Feedback Data 8</description>
          <addressOffset>0x28</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST9</name>
          <displayName>CRYPTO_HMAC_DGST9</displayName>
          <description>SHA/HMAC Output Feedback Data 9</description>
          <addressOffset>0x2C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST10</name>
          <displayName>CRYPTO_HMAC_DGST10</displayName>
          <description>SHA/HMAC Output Feedback Data 10</description>
          <addressOffset>0x30</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST11</name>
          <displayName>CRYPTO_HMAC_DGST11</displayName>
          <description>SHA/HMAC Output Feedback Data 11</description>
          <addressOffset>0x34</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST12</name>
          <displayName>CRYPTO_HMAC_DGST12</displayName>
          <description>SHA/HMAC Output Feedback Data 12</description>
          <addressOffset>0x38</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST13</name>
          <displayName>CRYPTO_HMAC_DGST13</displayName>
          <description>SHA/HMAC Output Feedback Data 13</description>
          <addressOffset>0x3C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST14</name>
          <displayName>CRYPTO_HMAC_DGST14</displayName>
          <description>SHA/HMAC Output Feedback Data 14</description>
          <addressOffset>0x40</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST15</name>
          <displayName>CRYPTO_HMAC_DGST15</displayName>
          <description>SHA/HMAC Output Feedback Data 15</description>
          <addressOffset>0x44</addressOffset>
       </register>
       <register>
          <name>CRYPTO_HMAC_KEYCNT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_HMAC_KEYCNT</displayName>
          <description>SHA/HMAC Key Byte Count Register</description>
          <addressOffset>0x48</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEYCNT</name>
              <description>SHA/HMAC Key Byte Count\nThe CRYPTO_HMAC_KEYCNT keeps the byte count of key that SHA/HMAC engine operates. The register is 32-bit and the maximum byte count is 4G bytes. It can be read and written. \nWriting to the register CRYPTO_HMAC_KEYCNT as the SHA/HMAC accelerator operating does not affect the current SHA/HMAC operation. But the value of CRYPTO_HMAC_KEYCNT will be updated later on. Consequently, software can prepare the key count for the next SHA/HMAC operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_HMAC_SADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_HMAC_SADDR</displayName>
          <description>SHA/HMAC DMA Source Address Register</description>
          <addressOffset>0x4C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SADDR</name>
              <description>SHA/HMAC DMA Source Address\nThe SHA/HMAC accelerator supports DMA function to transfer the plain text between SRAM memory space and embedded FIFO. The CRYPTO_HMAC_SADDR keeps the source address of the data buffer where the source text is stored. Based on the source address, the SHA/HMAC accelerator can read the plain text from SRAM memory space and do SHA/HMAC operation. The start of source address should be located at word boundary. In other words, bit 1 and 0 of CRYPTO_HMAC_SADDR are ignored.\nCRYPTO_HMAC_SADDR can be read and written. Writing to CRYPTO_HMAC_SADDR while the SHA/HMAC accelerator is operating does not affect the current SHA/HMAC operation. But the value of CRYPTO_HMAC_SADDR will be updated later on. Consequently, software can prepare the DMA source address for the next SHA/HMAC operation.\nIn DMA mode, software can update the next CRYPTO_HMAC_SADDR before triggering START.\nCRYPTO_HMAC_SADDR and CRYPTO_HMAC_DADDR can be the same in the value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
