Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/M2354_v1.svd
       <register>
          <name>CRYPTO_HMAC_DMACNT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_HMAC_DMACNT</displayName>
          <description>SHA/HMAC Byte Count Register</description>
          <addressOffset>0x50</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMACNT</name>
              <description>SHA/HMAC Operation Byte Count\nThe CRYPTO_HMAC_DMACNT keeps the byte count of source text that is for the SHA/HMAC engine operating in DMA mode. The CRYPTO_HMAC_DMACNT is 32-bit and the maximum of byte count is 4G bytes.\nCRYPTO_HMAC_DMACNT can be read and written. Writing to CRYPTO_HMAC_DMACNT while the SHA/HMAC accelerator is operating does not affect the current SHA/HMAC operation. But the value of CRYPTO_HMAC_DMACNT will be updated later on. Consequently, software can prepare the byte count of data for the next SHA/HMAC operation.\nIn Non-DMA mode, CRYPTO_HMAC_DMACNT must be set as the byte count of the last block before feeding in the last block of data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_HMAC_DATIN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_HMAC_DATIN</displayName>
          <description>SHA/HMAC Engine Non-dMA Mode Data Input Port Register</description>
          <addressOffset>0x54</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATIN</name>
              <description>SHA/HMAC Engine Input Port\nCPU feeds data to SHA/HMAC engine through this port by checking CRYPTO_HMAC_STS. Feed data as DATINREQ is 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_HMAC_FDBCK0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_HMAC_FDBCK0</displayName>
          <description>SHA/HMAC Output Feedback Data 0 After SHA/HMAC Operation</description>
          <addressOffset>0x58</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FDBCK</name>
              <description>SHA/HMAC Feedback Information\nThe feedback value is 1728 bits in size for SHA1/2.\nThe SHA/HMAC engine uses the data from CRYPTO_HMAC_FDBCKx as the data inputted to CRYPTO_HMAC_FDBCKx for the next block in DMA cascade mode.\nThe SHA/HMAC engine outputs feedback information for initial setting in the next block's operation. Software can store that feedback value temporarily. After switching back, fill the stored feedback value to CRYPTO_HMAC_FDBCKx in the same operation, and then continue the operation with the original setting.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK1</name>
          <displayName>CRYPTO_HMAC_FDBCK1</displayName>
          <description>SHA/HMAC Output Feedback Data 1 After SHA/HMAC Operation</description>
          <addressOffset>0x5C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK2</name>
          <displayName>CRYPTO_HMAC_FDBCK2</displayName>
          <description>SHA/HMAC Output Feedback Data 2 After SHA/HMAC Operation</description>
          <addressOffset>0x60</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK3</name>
          <displayName>CRYPTO_HMAC_FDBCK3</displayName>
          <description>SHA/HMAC Output Feedback Data 3 After SHA/HMAC Operation</description>
          <addressOffset>0x64</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK4</name>
          <displayName>CRYPTO_HMAC_FDBCK4</displayName>
          <description>SHA/HMAC Output Feedback Data 4 After SHA/HMAC Operation</description>
          <addressOffset>0x68</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK5</name>
          <displayName>CRYPTO_HMAC_FDBCK5</displayName>
          <description>SHA/HMAC Output Feedback Data 5 After SHA/HMAC Operation</description>
          <addressOffset>0x6C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK6</name>
          <displayName>CRYPTO_HMAC_FDBCK6</displayName>
          <description>SHA/HMAC Output Feedback Data 6 After SHA/HMAC Operation</description>
          <addressOffset>0x70</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK7</name>
          <displayName>CRYPTO_HMAC_FDBCK7</displayName>
          <description>SHA/HMAC Output Feedback Data 7 After SHA/HMAC Operation</description>
          <addressOffset>0x74</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK8</name>
          <displayName>CRYPTO_HMAC_FDBCK8</displayName>
          <description>SHA/HMAC Output Feedback Data 8 After SHA/HMAC Operation</description>
          <addressOffset>0x78</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK9</name>
          <displayName>CRYPTO_HMAC_FDBCK9</displayName>
          <description>SHA/HMAC Output Feedback Data 9 After SHA/HMAC Operation</description>
          <addressOffset>0x7C</addressOffset>
       </register>
