Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/M2354_v1.svd
       <register>
          <name>CRYPTO_RSA_KSCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_RSA_KSCTL</displayName>
          <description>RSA Key Control Register</description>
          <addressOffset>0x450</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NUM</name>
              <description>Read Key Number\nThe key number is sent to key store</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RSRC</name>
              <description>Read Key Source</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>key is read from RSA engine</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>key is read from key store</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
            <field>
              <name>RSSRC</name>
              <description>Read Key Store Source</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Key is read from the SRAM of key store</description>
                    <value>#00</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
            <field>
              <name>BKNUM</name>
              <description>Read Exponent Blind Key Number\nThe key number is sent to key store, and its destination always be the SRAM of key store. CPU can't read the exponent blind key.\nNote: Use this key number only when executing SCA protection but no-CRT mode.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_RSA_KSSTS0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_RSA_KSSTS0</displayName>
          <description>RSA Key Status Register 0</description>
          <addressOffset>0x454</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NUM0</name>
              <description>Key Number0\nThe key number is generated by key store, RSA can get complete p by key number in Key Store while operating. \nNote: The size of this key as half key length.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NUM1</name>
              <description>Key Number1\nThe key number is generated by key store, RSA can get complete q by key number in Key Store while operating. \nNote: The size of this key as half key length.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NUM2</name>
              <description>Key Number2\nThe key number is generated by key store, RSA can get or store the intermediate temporary value by key number in Key Store while operating. \nNote: The size of this key as key length.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NUM3</name>
              <description>Key Number3\nThe key number is generated by key store, RSA can get or store the intermediate temporary value by key number in Key Store while operating. \nNote: The size of this key as key length.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_RSA_KSSTS1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_RSA_KSSTS1</displayName>
          <description>RSA Key Status Register 1</description>
          <addressOffset>0x458</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NUM4</name>
              <description>Key Number4\nThe key number is generated by key store, RSA can get or store the intermediate temporary value by key number in Key Store while operating. \nNote: The size of this key as half key length.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NUM5</name>
              <description>Key Number5\nThe key number is generated by key store, RSA can get or store the intermediate temporary value by key number in Key Store while operating. \nNote: The size of this key as half key length.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NUM6</name>
              <description>Key Number6\nThe key number is generated by key store, RSA can get or store the intermediate temporary value by key number in Key Store while operating. \nNote: The size of this key as key length.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NUM7</name>
              <description>Key Number7\nThe key number is generated by key store, RSA can get or store the intermediate temporary value by key number in Key Store while operating. \nNote: The size of this key as key length.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
