Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/M2354_v1.svd
       <register>
          <name>KS_STS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>KS_STS</displayName>
          <description>Key Store Status Register</description>
          <addressOffset>0x8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IF</name>
              <description>Key Store Finish Interrupt Flag\nThis bit is cleared by writing 1 and it has no effect by writing 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No Key Store interrupt</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Key Store operation done interrupt</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>EIF</name>
              <description>Key Store Error Flag\nThis bit is cleared by writing 1 and it has no effect by writing 0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No Key Store error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Key Store error interrupt</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>Key Store Busy Flag (read only)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Key Store is idle or finished</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Key Store is busy</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>SRAMFULL</name>
              <description>Key Storage at SRAM Full Status Bit (read only)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Key Storage at SRAM is not full</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Key Storage at SRAM is full</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>FLASHFULL</name>
              <description>Key Storage at Flash Full Status Bit (Read Only)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Key Storage at Flash is not full</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Key Storage at Flash is full</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>INITDONE</name>
              <description>Key Store Initialization Done Status (Read Only)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Key Store is un-initialized</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Key Store is initialized</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>RAMINV</name>
              <description>Key Store SRAM Invert Status (Read Only)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Key Store key in SRAM is normal</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Key Store key in SRAM is inverted</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>KS_REMAIN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>KS_REMAIN</displayName>
          <description>Key Store Remaining Space Register</description>
          <addressOffset>0xC</addressOffset>
          <access>read-only</access>
          <resetValue>0x08001000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RRMNG</name>
              <description>Key Store SRAM Remaining Space\nThe RRMNG shows the remaining byte count space for SRAM.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FRMNG</name>
              <description>Key Store Flash Remaining Space\nThe FRMNG shows the remaining byte count space for Flash.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>KS_SCMBKEY0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>KS_SCMBKEY0</displayName>
          <description>Key Store Scramble Key Word 0 Register</description>
          <addressOffset>0x10</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCMBKEY</name>
              <description>Key Store Scramble Key\nWhen SCMB(KS_CTL[]) is set to 1, user should write the scramble key in this register before new key stores in Key Store. If user does not write the scramble key in this register, the Key Store will use previous scramble key to execute data scramble function.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="KS_SCMBKEY0">
          <name>KS_SCMBKEY1</name>
          <displayName>KS_SCMBKEY1</displayName>
          <description>Key Store Scramble Key Word 1 Register</description>
          <addressOffset>0x14</addressOffset>
       </register>
       <register derivedFrom="KS_SCMBKEY0">
          <name>KS_SCMBKEY2</name>
          <displayName>KS_SCMBKEY2</displayName>
          <description>Key Store Scramble Key Word 2 Register</description>
          <addressOffset>0x18</addressOffset>
       </register>
       <register derivedFrom="KS_SCMBKEY0">
          <name>KS_SCMBKEY3</name>
          <displayName>KS_SCMBKEY3</displayName>
          <description>Key Store Scramble Key Word 3 Register</description>
          <addressOffset>0x1C</addressOffset>
       </register>
       <register>
          <name>KS_KEY0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>KS_KEY0</displayName>
          <description>Key Store Entry Key Word 0 Register</description>
          <addressOffset>0x20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEY</name>
              <description>Key Data \nThe register will be cleared if the Key Store executes the write operation or CPU completes the reading key.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="KS_KEY0">
          <name>KS_KEY1</name>
          <displayName>KS_KEY1</displayName>
          <description>Key Store Entry Key Word 1 Register</description>
          <addressOffset>0x24</addressOffset>
       </register>
       <register derivedFrom="KS_KEY0">
          <name>KS_KEY2</name>
          <displayName>KS_KEY2</displayName>
          <description>Key Store Entry Key Word 2 Register</description>
          <addressOffset>0x28</addressOffset>
       </register>
       <register derivedFrom="KS_KEY0">
          <name>KS_KEY3</name>
          <displayName>KS_KEY3</displayName>
          <description>Key Store Entry Key Word 3 Register</description>
          <addressOffset>0x2C</addressOffset>
       </register>
       <register derivedFrom="KS_KEY0">
          <name>KS_KEY4</name>
          <displayName>KS_KEY4</displayName>
          <description>Key Store Entry Key Word 4 Register</description>
          <addressOffset>0x30</addressOffset>
       </register>
       <register derivedFrom="KS_KEY0">
          <name>KS_KEY5</name>
          <displayName>KS_KEY5</displayName>
          <description>Key Store Entry Key Word 5 Register</description>
          <addressOffset>0x34</addressOffset>
       </register>
       <register derivedFrom="KS_KEY0">
          <name>KS_KEY6</name>
          <displayName>KS_KEY6</displayName>
          <description>Key Store Entry Key Word 6 Register</description>
          <addressOffset>0x38</addressOffset>
       </register>
       <register derivedFrom="KS_KEY0">
          <name>KS_KEY7</name>
          <displayName>KS_KEY7</displayName>
          <description>Key Store Entry Key Word 7 Register</description>
          <addressOffset>0x3C</addressOffset>
       </register>
       <register>
          <name>KS_OTPSTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>KS_OTPSTS</displayName>
          <description>Key Store OTP Keys Status Register</description>
          <addressOffset>0x40</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEY0</name>
              <description>OTP Key 0 Used Status\nNote: If chip is changed to RMA stage, the existing key will be revoked after initialization.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>OTP key 0 is unused</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>OTP key 0 is used</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY1</name>
              <description>OTP Key 1 Used Status\nNote: If chip is changed to RMA stage, the existing key will be revoked after initialization.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>OTP key 1 is unused</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>OTP key 1 is used</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY2</name>
              <description>OTP Key 2 Used Status\nNote: If chip is changed to RMA stage, the existing key will be revoked after initialization.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>OTP key 2 is unused</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>OTP key 2 is used</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY3</name>
              <description>OTP Key 3 Used Status\nNote: If chip is changed to RMA stage, the existing key will be revoked after initialization.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>OTP key 3 is unused</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>OTP key 3 is used</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY4</name>
              <description>OTP Key 4 Used Status\nNote: If chip is changed to RMA stage, existing key will be revoked after initialization.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>OTP key 4 is unused</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>OTP key 4 is used</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY5</name>
              <description>OTP Key 5 Used Status\nNote: If chip is changed to RMA stage, the existing key will be revoked after initialization.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>OTP key 5 is unused</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>OTP key 5 is used</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY6</name>
              <description>OTP Key 6 Used Status\nNote: If chip is changed to RMA stage, the existing key will be revoked after initialization.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>OTP key 6 is unused</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>OTP key 6 is used</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY7</name>
              <description>OTP Key 7 Used Status\nNote: If chip is changed to RMA stage, the existing key will be revoked after initialization.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>OTP key 7 is unused</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>OTP key 7 is used</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>KS_REMKCNT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>KS_REMKCNT</displayName>
          <description>Key Store Remaining Key Count Register</description>
          <addressOffset>0x44</addressOffset>
          <access>read-only</access>
          <resetValue>0x00200020</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RRMKCNT</name>
              <description>Key Store SRAM Remaining Key Count\nThe RRMKCNT shows the remaining key count for SRAM.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FRMKCNT</name>
              <description>Key Store Flash Remaining Key Count\nThe FRMKCNT shows the remaining key count for Flash.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
