Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/M2354_v1.svd
       <register>
          <name>LCD_PKGSEL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>LCD_PKGSEL</displayName>
          <description>LCD Package Selection Register</description>
          <addressOffset>0x10</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKG</name>
              <description>Device Package Type Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>128-Pin Package</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>64-Pin Package</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>LCD_STS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>LCD_STS</displayName>
          <description>LCD Status Register</description>
          <addressOffset>0x14</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FCEF</name>
              <description>End of Frame Counting Flag\nThis flag is automatically set by hardware at the end of a frame, and the frame counter value must be equal to FCV (LCD_FCTL[17:8], Frame Counting Value).\nNote 1: User can clear this bit by writing 1 to it.\nNote 2: For type B waveform, this flag is set only at the end of an odd frame.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>End of Frame Counting did not occur</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>End of Frame Counting occurred</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>FEF</name>
              <description>End of Frame Flag\nThis flag is automatically set by hardware at the end of a frame.\nNote 1: User can clear this bit by writing 1 to it.\nNote 2: For type B waveform, this flag is set only at the end of an odd frame.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>End of Frame did not occur</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>End of Frame occurred</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CTOF</name>
              <description>Charging Timeout Flag\nThis flag is automatically set by hardware when the charging timer reaches the timeout value.\nNote: User can clear this bit by writing 1 to it.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Charging Timeout did not occur</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Charging Timeout occurred</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CTIME</name>
              <description>Charging Timer Value (Read Only)\nThe field contains the value of the charging timer. It records the charging time of the charge pump.\nThe charging timer stops counting when the charge pump stops charging or a timeout occurs. At this moment, the hardware dumps the current charging timer value into this field.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>LCD_INTEN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>LCD_INTEN</displayName>
          <description>LCD Interrupt Enable Register</description>
          <addressOffset>0x18</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FCEIEN</name>
              <description>End of Frame Counting Interrupt Enable Bit\nAn interrupt occurs at the end of a frame, and the frame counter value must be equal to FCV (LCD_FCTL[17:8], Frame Counting Value).\nNote: For type B waveform, the interrupt occurs only at the end of an odd frame.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>End of Frame Counting Interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>End of Frame Counting Interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>FEIEN</name>
              <description>End of Frame Interrupt Enable Bit\nAn interrupt occurs at the end of a frame.\nNote: For type B waveform, the interrupt occurs only at the end of an odd frame.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>End of Frame Interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>End of Frame Interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CTOIEN</name>
              <description>Charging Timeout Interrupt Enable Bit\nAn interrupt occurs when the charging timer reaches the timeout value.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Charging Timeout Interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Charging Timeout Interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>LCD_DATA00</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>LCD_DATA00</displayName>
          <description>LCD Segment Display Data Register 0</description>
          <addressOffset>0x20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DD0</name>
              <description>Display Data of Segments S, where S is 4 x N + 0, and N is 0, 1, 2, ..., 10\nEach bit specifies the brightness of each pixel in a segment.\nLCD_DATA07[7:4] are ignored, since COMs from 4 to 7 are not used.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The pixel is light</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The pixel is dark</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DD1</name>
              <description>Display Data of Segments S, where S is 4 x N + 1, and N is 0, 1, 2, ..., 10\nEach bit specifies the brightness of each pixel in a segment.\nLCD_DATA07[15:12] are ignored, since COMs from 4 to 7 are not used.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The pixel is light</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The pixel is dark</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DD2</name>
              <description>Display Data of Segments S, where S is 4 x N + 2, and N is 0, 1, 2, ..., 10\nEach bit specifies the brightness of each pixel in a segment.\nLCD_DATA07[23:20] are ignored, since COMs from 4 to 7 are not used.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The pixel is light</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The pixel is dark</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DD3</name>
              <description>Display Data of Segments S, where S is 4 x N + 3, and N is 0, 1, 2, ..., 10\nEach bit specifies the brightness of each pixel in a segment.\nLCD_DATA07[31:28] are ignored, since COMs from 4 to 7 are not used.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The pixel is light</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The pixel is dark</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="LCD_DATA00">
          <name>LCD_DATA01</name>
          <displayName>LCD_DATA01</displayName>
          <description>LCD Segment Display Data Register 1</description>
          <addressOffset>0x24</addressOffset>
       </register>
       <register derivedFrom="LCD_DATA00">
          <name>LCD_DATA02</name>
          <displayName>LCD_DATA02</displayName>
          <description>LCD Segment Display Data Register 2</description>
          <addressOffset>0x28</addressOffset>
       </register>
       <register derivedFrom="LCD_DATA00">
          <name>LCD_DATA03</name>
          <displayName>LCD_DATA03</displayName>
          <description>LCD Segment Display Data Register 3</description>
          <addressOffset>0x2C</addressOffset>
       </register>
       <register derivedFrom="LCD_DATA00">
          <name>LCD_DATA04</name>
          <displayName>LCD_DATA04</displayName>
          <description>LCD Segment Display Data Register 4</description>
          <addressOffset>0x30</addressOffset>
       </register>
       <register derivedFrom="LCD_DATA00">
          <name>LCD_DATA05</name>
          <displayName>LCD_DATA05</displayName>
          <description>LCD Segment Display Data Register 5</description>
          <addressOffset>0x34</addressOffset>
       </register>
       <register derivedFrom="LCD_DATA00">
          <name>LCD_DATA06</name>
          <displayName>LCD_DATA06</displayName>
          <description>LCD Segment Display Data Register 6</description>
          <addressOffset>0x38</addressOffset>
       </register>
       <register derivedFrom="LCD_DATA00">
          <name>LCD_DATA07</name>
          <displayName>LCD_DATA07</displayName>
          <description>LCD Segment Display Data Register 7</description>
          <addressOffset>0x3C</addressOffset>
       </register>
       <register derivedFrom="LCD_DATA00">
          <name>LCD_DATA08</name>
          <displayName>LCD_DATA08</displayName>
          <description>LCD Segment Display Data Register 8</description>
          <addressOffset>0x40</addressOffset>
       </register>
       <register derivedFrom="LCD_DATA00">
          <name>LCD_DATA09</name>
          <displayName>LCD_DATA09</displayName>
          <description>LCD Segment Display Data Register 9</description>
          <addressOffset>0x44</addressOffset>
       </register>
       <register derivedFrom="LCD_DATA00">
          <name>LCD_DATA10</name>
          <displayName>LCD_DATA10</displayName>
          <description>LCD Segment Display Data Register 10</description>
          <addressOffset>0x48</addressOffset>
       </register>
