Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/M2354_v1.svd
       <register>
          <name>TAMPER_ACTSTIOCTL2</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>TAMPER_ACTSTIOCTL2</displayName>
          <description>Tamper Active Shield Tamper I/O Function Control Register 2</description>
          <addressOffset>0x28</addressOffset>
          <access>read-write</access>
          <resetValue>0x80808000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADYN1ISS2</name>
              <description>Active Shied Dynamic Pair 1 Input Source Select 2\nThis bit determines if Tamper 3 input is from Tamper 2 or Tamper 0 in dynamic mode.\nNote: This bit is effective only when ADYNPR1EN2 (TAMPER_ACTSTIOCTL2[23]) and ADYNPR0EN2 (TAMPER_ACTSTIOCTL2[15]) are set.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Tamper input is from Tamper 2</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Tamper input is from Tamper 0</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ADYNSRC2</name>
              <description>Active Shied Dynamic Reference Pattern 2\nThis field determines the new reference pattern when current pattern run out in dynamic pair mode.\nNote: After this bit is modified, the SEEDRLD2 (TAMPER_ACTSTIOCTL2[4]) should be set.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The new reference pattern is generated by random number generator when the reference pattern run out</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The new reference pattern is repeated from SEED2 (TAMPER_SEED2[31:0]) when the reference pattern run out</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SEEDRLD2</name>
              <description>Reload New Seed for PRNG Engine 2\nSetting this bit, the tamper configuration will be reloaded.\nNote 1: Before this bit is set, the tamper configuration should be set to complete and this bit will be auto clear to 0 after reload new seed completed.\nNote 2: The reference is TLIRC 32K-clock. Tamper detector needs sync 2 ~ 3 TLIRC 32K-clock.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Generating key based on the current seed</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reload new seed</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ADYNRATE2</name>
              <description>Active Shied Dynamic Change Rate 2\nUse the bits to choose the dynamic tamper output change rate.\nNote: After this field is modified, setting SEEDRLD2 (TAMPER_ACTSTIOCTL2[4]) can reload change rate immediately.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>210 * TLIRC32K</description>
                    <value>#000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>211 * TLIRC32K</description>
                    <value>#001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>212 * TLIRC32K</description>
                    <value>#010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>213 * TLIRC32K</description>
                    <value>#011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>214 * TLIRC32K</description>
                    <value>#100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>215 * TLIRC32K</description>
                    <value>#101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>216 * TLIRC32K</description>
                    <value>#110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>217 * TLIRC32K</description>
                    <value>#111</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ATAMP0EN2</name>
              <description>Active Shied Tamper0 Detect Enable Bit 2\nNote: The reference is TLIRC 32K-clock. Tamper detector needs sync 2 ~ 3 TLIRC 32K-clock.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Tamper 0 detect Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Tamper 0 detect Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ATAMP1EN2</name>
              <description>Active Shied Tamper 1 Detect Enable Bit 2\nNote: The reference is TLIRC 32K-clock. Tamper detector needs sync 2 ~ 3 TLIRC 32K-clock.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Tamper 1 detect Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Tamper 1 detect Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ADYNPR0EN2</name>
              <description>Active Shied Dynamic Pair 0 Enable Bit 2</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Static detect (Not supported)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Dynamic detect</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ATAMP2EN2</name>
              <description>Active Shied Tamper 2 Detect Enable Bit 2\nNote: The reference is TLIRC 32K-clock. Tamper detector needs sync 2 ~ 3 TLIRC 32K-clock.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Tamper 2 detect Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Tamper 2 detect Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ATAMP3EN2</name>
              <description>Active Shied Tamper 3 Detect Enable Bit 2\nNote: The reference is TLIRC 32K-clock. Tamper detector needs sync 2 ~ 3 TLIRC 32K-clock.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Tamper 3 detect Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Tamper 3 detect Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ADYNPR1EN2</name>
              <description>Active Shied Dynamic Pair 1 Enable Bit 2</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Static detect (Not supported)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Dynamic detect</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ATAMP4EN2</name>
              <description>Active Shied Tamper4 Detect Enable Bit 2\nNote: The reference is TLIRC 32K-clock. Tamper detector need sync 2 ~ 3 TLIRC 32K-clock.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Tamper 4 detect Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Tamper 4 detect Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ATAMP5EN2</name>
              <description>Active Tamper 5 Detect Enable Bit 2\nNote: The reference is TLIRC 32K-clock. Tamper detector need sync 2 ~ 3 TLIRC 32K-clock.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Tamper 5 detect Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Tamper 5 detect Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ADYNPR2EN2</name>
              <description>Active Shied Dynamic Pair 2 Enable Bit 2</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Static detect (Not supported)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Dynamic detect</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>TAMPER_CDBR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>TAMPER_CDBR</displayName>
          <description>Tamper Clock Frequency Detector Boundary Register</description>
          <addressOffset>0x2C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00F0000F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STOPBD</name>
              <description>LXT Clock Frequency Detector Stop Boundary\nThe bits define the stop value of frequency monitor window.\nWhen LXT frequency monitor counter lower than Clock Frequency Detector Stop Boundary, the LXT frequency detect stop interrupt flag will set to 1.\nNote: The boundary is defined as the maximum value of LXT among 256 Tamper clock time.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAILBD</name>
              <description>LXT Clock Frequency Detector Fail Boundary\nThe bits define the fail value of frequency monitor window.\nWhen LXT frequency monitor counter lower than Clock Frequency Detector Fail Boundary, the LXT frequency detect fail interrupt flag will set to 1.\nNote: The boundary is defined as the minimum value of LXT among 256 Tamper clock time.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>TAMPER_VG</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>TAMPER_VG</displayName>
          <description>Tamper Voltage Glitch Control Register</description>
          <addressOffset>0x30</addressOffset>
          <access>read-write</access>
          <resetValue>0x58765876</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PCLKSEL0</name>
              <description>PL0 Positive Clock Trim Range\nThe setting value of the positive clock tolerance.\nOne step is about 2.5% tolerance. The maximum tolerance is 20%.\nNote: PL0 means the power level is 1.26V\nThe power level is controlled in system manager</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NCLKSEL0</name>
              <description>PL0 Negative Clock Trim Range\nThe setting value of the negative clock tolerance.\nOne step is about 2.5% tolerance. The maximum tolerance is 20%.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDATSEL0</name>
              <description>PL0 Positive Data Trim Range\nThe setting value of the positive data tolerance.\nOne step is about 2.5% tolerance. The maximum tolerance is 20%.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NDATSEL0</name>
              <description>PL0 Negative Data Trim Range\nThe setting value of the negative data tolerance.\nOne step is about 2.5% tolerance. The maximum tolerance is 20%.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCLKSEL1</name>
              <description>PL1 Positive Clock Trim Range\nThe setting value of the positive clock tolerance.\nOne step is about 2.5% tolerance. The maximum tolerance is 20%.\nNote: PL1 means the power level is 1.2V</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NCLKSEL1</name>
              <description>PL1 Negative Clock Trim Range\nThe setting value of the negative clock tolerance.\nOne step is about 2.5% tolerance. The maximum tolerance is 20%.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDATSEL1</name>
              <description>PL1 Positive Data Trim Range\nThe setting value of the positive data tolerance.\nOne step is about 2.5% tolerance. The maximum tolerance is 20%.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NDATSEL1</name>
              <description>PL1 Negative Data Trim Range\nThe setting value of the negative data tolerance.\nOne step is about 2.5% tolerance. The maximum tolerance is 20%.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>TAMPER_VGEV</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>TAMPER_VGEV</displayName>
          <description>Tamper Voltage Glitch Event Tolerance Control Register</description>
          <addressOffset>0x34</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000303</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VGECNTP</name>
              <description>Positive Voltage Glitch Error Tolerance\nThe value indicates the tolerance count for positive voltage glitch event.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VGECNTN</name>
              <description>Negative Voltage Glitch Error Tolerance\nThe value indicates the tolerance count for negative voltage glitch event.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>TAMPER_LDOTRIM</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>TAMPER_LDOTRIM</displayName>
          <description>Tamper LDO Trim Value Control Register</description>
          <addressOffset>0x38</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000108</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TLDOTRIM</name>
              <description>Voltage Regulator Output Voltage Trim\nThe value indicates the trim value of the voltage regulator output voltage.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TLDOIQSEL</name>
              <description>Voltage Regulator Qu Current Selection\nIndicates the Qu current selection of voltage regulator.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>TAMPER_LBSTRIM</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>TAMPER_LBSTRIM</displayName>
          <description>Tamper LDO BIAS Trim Value Control Register</description>
          <addressOffset>0x3C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00005505</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TLVDSEL</name>
              <description>Under-shoot Detect Level Trim Bits\nThe value indicates the trim value of the under-shoot detection level</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOVDSEL</name>
              <description>Over-shoot Detect Level Trim Bits\nThe value indicates the trim value of the over-shoot detection level</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BSCMPLV</name>
              <description>Under-shoot Detect Comparator Current Trim Bits\nThe value indicates the trim value of the under-shoot detection comparator current trim level</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BSCMPOV</name>
              <description>Over-shoot Detect Comparator Current Trim Bits\nThe value indicates the trim value of the over-shoot detection comparator current trim level</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYSCMPLV</name>
              <description>Under-shoot Detect Comparator Hysteresis Trim Bits\nThe value indicates the trim value of the under-shoot detection comparator of hysteresis trim level</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HYSCMPOV</name>
              <description>Over-shoot Detect Comparator Hysteresis Trim Bits\nThe value indicates the trim value of the over-shoot detection comparator of hysteresis trim level</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
