Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/M2354_v1.svd
       <register derivedFrom="SCU_APB0VSRC">
          <name>SCU_APB1VSRC</name>
          <displayName>SCU_APB1VSRC</displayName>
          <description>APB1 Security Policy Violation Source</description>
          <addressOffset>0x3C</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0VA">
          <name>SCU_APB1VA</name>
          <displayName>SCU_APB1VA</displayName>
          <description>APB1 Violation Address</description>
          <addressOffset>0x40</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0VSRC">
          <name>SCU_GPIOVSRC</name>
          <displayName>SCU_GPIOVSRC</displayName>
          <description>GPIO Security Policy Violation Source</description>
          <addressOffset>0x44</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0VA">
          <name>SCU_GPIOVA</name>
          <displayName>SCU_GPIOVA</displayName>
          <description>GPIO Violation Address</description>
          <addressOffset>0x48</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0VSRC">
          <name>SCU_EBIVSRC</name>
          <displayName>SCU_EBIVSRC</displayName>
          <description>EBI Security Policy Violation Source</description>
          <addressOffset>0x4C</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0VA">
          <name>SCU_EBIVA</name>
          <displayName>SCU_EBIVA</displayName>
          <description>EBI Violation Address</description>
          <addressOffset>0x50</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0VSRC">
          <name>SCU_USBHVSRC</name>
          <displayName>SCU_USBHVSRC</displayName>
          <description>USBH Security Policy Violation Source</description>
          <addressOffset>0x54</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0VA">
          <name>SCU_USBHVA</name>
          <displayName>SCU_USBHVA</displayName>
          <description>USBH Violation Address</description>
          <addressOffset>0x58</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0VSRC">
          <name>SCU_CRCVSRC</name>
          <displayName>SCU_CRCVSRC</displayName>
          <description>CRC Security Policy Violation Source</description>
          <addressOffset>0x5C</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0VA">
          <name>SCU_CRCVA</name>
          <displayName>SCU_CRCVA</displayName>
          <description>CRC Violation Address</description>
          <addressOffset>0x60</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0VSRC">
          <name>SCU_SD0VSRC</name>
          <displayName>SCU_SD0VSRC</displayName>
          <description>SDH0 Security Policy Violation Source</description>
          <addressOffset>0x64</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0VA">
          <name>SCU_SD0VA</name>
          <displayName>SCU_SD0VA</displayName>
          <description>SDH0 Violation Address</description>
          <addressOffset>0x68</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0VSRC">
          <name>SCU_PDMA0VSRC</name>
          <displayName>SCU_PDMA0VSRC</displayName>
          <description>PDMA0 Security Policy Violation Source</description>
          <addressOffset>0x74</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0VA">
          <name>SCU_PDMA0VA</name>
          <displayName>SCU_PDMA0VA</displayName>
          <description>PDMA0 Violation Address</description>
          <addressOffset>0x78</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0VSRC">
          <name>SCU_PDMA1VSRC</name>
          <displayName>SCU_PDMA1VSRC</displayName>
          <description>PDMA1 Security Policy Violation Source</description>
          <addressOffset>0x7C</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0VA">
          <name>SCU_PDMA1VA</name>
          <displayName>SCU_PDMA1VA</displayName>
          <description>PDMA1 Violation Address</description>
          <addressOffset>0x80</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0VSRC">
          <name>SCU_SRAM0VSRC</name>
          <displayName>SCU_SRAM0VSRC</displayName>
          <description>SRAM0 Security Policy Violation Source</description>
          <addressOffset>0x84</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0VA">
          <name>SCU_SRAM0VA</name>
          <displayName>SCU_SRAM0VA</displayName>
          <description>SRAM0 Violation Address</description>
          <addressOffset>0x88</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0VSRC">
          <name>SCU_SRAM1VSRC</name>
          <displayName>SCU_SRAM1VSRC</displayName>
          <description>SRAM1 Security Policy Violation Source</description>
          <addressOffset>0x8C</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0VA">
          <name>SCU_SRAM1VA</name>
          <displayName>SCU_SRAM1VA</displayName>
          <description>SRAM1 Violation Address</description>
          <addressOffset>0x90</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0VSRC">
          <name>SCU_FMCVSRC</name>
          <displayName>SCU_FMCVSRC</displayName>
          <description>FMC Security Policy Violation Source</description>
          <addressOffset>0x94</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0VA">
          <name>SCU_FMCVA</name>
          <displayName>SCU_FMCVA</displayName>
          <description>FMC Violation Address</description>
          <addressOffset>0x98</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0VSRC">
          <name>SCU_FLASHVSRC</name>
          <displayName>SCU_FLASHVSRC</displayName>
          <description>Flash Security Policy Violation Source</description>
          <addressOffset>0x9C</addressOffset>
       </register>
       <register derivedFrom="SCU_APB0VA">
          <name>SCU_FLASHVA</name>
          <displayName>SCU_FLASHVA</displayName>
          <description>Flash Violation Address</description>
          <addressOffset>0xA0</addressOffset>
       </register>
