Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/M2354_v1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>AES_NS</name>
      <description>CRYPTO Register Map</description>
      <groupName>CRYPTO</groupName>
      <baseAddress>0x50032050</baseAddress>
      <!-- d -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0x18</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x50</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xB0</offset>
        <size>0x4C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xEC0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>CRYPTO_AES_FDBCK0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_AES_FDBCK0</displayName>
          <description>AES Engine Output Feedback Data After Cryptographic Operation</description>
          <addressOffset>0x0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FDBCK</name>
              <description>AES Feedback Information\nThe feedback value is 128 bits in size.\nThe AES engine uses the data from CRYPTO_AES_FDBCKx as the data inputted to CRYPTO_AES_IVx for the next block in DMA cascade mode.\nThe AES engine outputs feedback information for IV in the next block's operation. Software can use this feedback information to implement more than four DMA channels. Software can store that feedback value temporarily. After switching back, fill the stored feedback value to CRYPTO_AES_IVx in the same channel operation, and then continue the operation with the original setting.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_AES_FDBCK0">
          <name>CRYPTO_AES_FDBCK1</name>
          <displayName>CRYPTO_AES_FDBCK1</displayName>
          <description>AES Engine Output Feedback Data After Cryptographic Operation</description>
          <addressOffset>0x4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES_FDBCK0">
          <name>CRYPTO_AES_FDBCK2</name>
          <displayName>CRYPTO_AES_FDBCK2</displayName>
          <description>AES Engine Output Feedback Data After Cryptographic Operation</description>
          <addressOffset>0x8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES_FDBCK0">
          <name>CRYPTO_AES_FDBCK3</name>
          <displayName>CRYPTO_AES_FDBCK3</displayName>
          <description>AES Engine Output Feedback Data After Cryptographic Operation</description>
          <addressOffset>0xC</addressOffset>
       </register>
       <register>
          <name>CRYPTO_AES_GCM_IVCNT0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_AES_GCM_IVCNT0</displayName>
          <description>AES GCM IV Byte Count Register 0</description>
          <addressOffset>0x30</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>AES GCM IV Byte Count\nThe bit length of IV is 64 bits for AES GCM mode. The CRYPTO_AES_GCM_IVCNT0 keeps the low weight byte count of initial vector (i.e., len(IV)[34:3]) of AES GCM mode and can be read and written.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_AES_GCM_IVCNT1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_AES_GCM_IVCNT1</displayName>
          <description>AES GCM IV Byte Count Register 1</description>
          <addressOffset>0x34</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>AES GCM IV Byte Count\nThe bit length of IV is 64 bits for AES GCM mode. The CRYPTO_AES_GCM_IVCNT1 keeps the high weight byte count of initial vector (i.e., len(IV)[64:35]) of AES GCM mode and can be read and written.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_AES_GCM_ACNT0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_AES_GCM_ACNT0</displayName>
          <description>AES GCM A Byte Count Register 0</description>
          <addressOffset>0x38</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>AES GCM a Byte Count\nThe bit length of A is 64 bits for AES GCM mode. The CRYPTO_AES_GCM_ACNT0 keeps the low weight byte count of the additional authenticated data (i.e., len(A)[34:3]) of AES GCM mode and can be read and written.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_AES_GCM_ACNT1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_AES_GCM_ACNT1</displayName>
          <description>AES GCM A Byte Count Register 1</description>
          <addressOffset>0x3C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>AES GCM a Byte Count\nThe bit length of A is 64 bits for AES GCM mode. The CRYPTO_AES_GCM_ACNT0 keeps the high weight byte count of the additional authenticated data (i.e., len(A)[63:35]) of AES GCM mode and can be read and written.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_AES_GCM_PCNT0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_AES_GCM_PCNT0</displayName>
          <description>AES GCM P Byte Count Register 0</description>
          <addressOffset>0x40</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>AES GCM P Byte Count\nThe bit length of Por C is 39 bits for AES GCM mode. The CRYPTO_AES_GCM_PCNT0 keeps the low weight byte count of the plaintext or ciphertext (i.e., len(P)[34:3] or len(C)[34:3]) of AES GCM mode and can be read and written.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_AES_GCM_PCNT1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_AES_GCM_PCNT1</displayName>
          <description>AES GCM P Byte Count Register 1</description>
          <addressOffset>0x44</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>AES GCM P Byte Count\nThe bit length of Por C is 39 bits for AES GCM mode. The CRYPTO_AES_GCM_PCNT1 keeps the high weight byte count of the plaintext or ciphertext (i.e., len(P)[38:35] or  len(C)[38:35]) of AES GCM mode and can be read and written.\nThe bit length of Por C is 64 bits for AES CCM mode. The CRYPTO_AES_GCM_PCNT1 keeps the high weight byte count of the plaintext or ciphertext (i.e., len(P)[63:35] or  len(C)[63:35]) of AES CCM mode and can be read and written.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_AES_FBADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_AES_FBADDR</displayName>
          <description>AES DMA Feedback Address Register</description>
          <addressOffset>0x50</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FBADDR</name>
              <description>AES DMA Feedback Address\nIn DMA cascade mode, software can update DMA feedback address register for automatically reading and writing feedback values via DMA.The FBADDR keeps the feedback address of the feedback data for the next cascade operation. Based on the feedback address, the AES accelerator can read thefeedback data of the last cascade opeation from SRAM memory space and write thefeedback data of the current cascade opeation to SRAM memory space. The start of feedback address should be located at word boundary. In other words, bit 1 and 0 of FBADDR are ignored.\nFBADDR can be read and written.\nIn DMA mode, software can update the next CRYPTO_AES_FBADDR before triggering START.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
