Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/M2354_v1.svd
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_12</name>
          <displayName>CRYPTO_ECC_X1_12</displayName>
          <description>ECC the X-coordinate Word12 of the First Point</description>
          <addressOffset>0x38</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_13</name>
          <displayName>CRYPTO_ECC_X1_13</displayName>
          <description>ECC the X-coordinate Word13 of the First Point</description>
          <addressOffset>0x3C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_14</name>
          <displayName>CRYPTO_ECC_X1_14</displayName>
          <description>ECC the X-coordinate Word14 of the First Point</description>
          <addressOffset>0x40</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_15</name>
          <displayName>CRYPTO_ECC_X1_15</displayName>
          <description>ECC the X-coordinate Word15 of the First Point</description>
          <addressOffset>0x44</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_16</name>
          <displayName>CRYPTO_ECC_X1_16</displayName>
          <description>ECC the X-coordinate Word16 of the First Point</description>
          <addressOffset>0x48</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_17</name>
          <displayName>CRYPTO_ECC_X1_17</displayName>
          <description>ECC the X-coordinate Word17 of the First Point</description>
          <addressOffset>0x4C</addressOffset>
       </register>
       <register>
          <name>CRYPTO_ECC_Y1_00</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_Y1_00</displayName>
          <description>ECC the Y-coordinate Word0 of the First Point</description>
          <addressOffset>0x50</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>POINTY1</name>
              <description>ECC the Y-coordinate Value of the First Point \nFor B-163 or K-163, POINTY1 is stored in CRYPTO_ECC_Y1_00~CRYPTO_ECC_Y1_05\nFor B-233 or K-233, POINTY1 is stored in CRYPTO_ECC_Y1_00~CRYPTO_ECC_Y1_07\nFor B-283 or K-283, POINTY1 is stored in CRYPTO_ECC_Y1_00~CRYPTO_ECC_Y1_08\nFor B-409 or K-409, POINTY1 is stored in CRYPTO_ECC_Y1_00~CRYPTO_ECC_Y1_12\nFor B-571 or K-571, POINTY1 is stored in CRYPTO_ECC_Y1_00~CRYPTO_ECC_Y1_17\nFor P-192, POINTY1 is stored in CRYPTO_ECC_Y1_00~CRYPTO_ECC_Y1_05\nFor P-224, POINTY1 is stored in CRYPTO_ECC_Y1_00~CRYPTO_ECC_Y1_06\nFor P-256, POINTY1 is stored in CRYPTO_ECC_Y1_00~CRYPTO_ECC_Y1_07\nFor P-384, POINTY1 is stored in CRYPTO_ECC_Y1_00~CRYPTO_ECC_Y1_11\nFor P-521, POINTY1 is stored in CRYPTO_ECC_Y1_00~CRYPTO_ECC_Y1_16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_01</name>
          <displayName>CRYPTO_ECC_Y1_01</displayName>
          <description>ECC the Y-coordinate Word1 of the First Point</description>
          <addressOffset>0x54</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_02</name>
          <displayName>CRYPTO_ECC_Y1_02</displayName>
          <description>ECC the Y-coordinate Word2 of the First Point</description>
          <addressOffset>0x58</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_03</name>
          <displayName>CRYPTO_ECC_Y1_03</displayName>
          <description>ECC the Y-coordinate Word3 of the First Point</description>
          <addressOffset>0x5C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_04</name>
          <displayName>CRYPTO_ECC_Y1_04</displayName>
          <description>ECC the Y-coordinate Word4 of the First Point</description>
          <addressOffset>0x60</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_05</name>
          <displayName>CRYPTO_ECC_Y1_05</displayName>
          <description>ECC the Y-coordinate Word5 of the First Point</description>
          <addressOffset>0x64</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_06</name>
          <displayName>CRYPTO_ECC_Y1_06</displayName>
          <description>ECC the Y-coordinate Word6 of the First Point</description>
          <addressOffset>0x68</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_07</name>
          <displayName>CRYPTO_ECC_Y1_07</displayName>
          <description>ECC the Y-coordinate Word7 of the First Point</description>
          <addressOffset>0x6C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_08</name>
          <displayName>CRYPTO_ECC_Y1_08</displayName>
          <description>ECC the Y-coordinate Word8 of the First Point</description>
          <addressOffset>0x70</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_09</name>
          <displayName>CRYPTO_ECC_Y1_09</displayName>
          <description>ECC the Y-coordinate Word9 of the First Point</description>
          <addressOffset>0x74</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_10</name>
          <displayName>CRYPTO_ECC_Y1_10</displayName>
          <description>ECC the Y-coordinate Word10 of the First Point</description>
          <addressOffset>0x78</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_11</name>
          <displayName>CRYPTO_ECC_Y1_11</displayName>
          <description>ECC the Y-coordinate Word11 of the First Point</description>
          <addressOffset>0x7C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_12</name>
          <displayName>CRYPTO_ECC_Y1_12</displayName>
          <description>ECC the Y-coordinate Word12 of the First Point</description>
          <addressOffset>0x80</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_13</name>
          <displayName>CRYPTO_ECC_Y1_13</displayName>
          <description>ECC the Y-coordinate Word13 of the First Point</description>
          <addressOffset>0x84</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_14</name>
          <displayName>CRYPTO_ECC_Y1_14</displayName>
          <description>ECC the Y-coordinate Word14 of the First Point</description>
          <addressOffset>0x88</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_15</name>
          <displayName>CRYPTO_ECC_Y1_15</displayName>
          <description>ECC the Y-coordinate Word15 of the First Point</description>
          <addressOffset>0x8C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_16</name>
          <displayName>CRYPTO_ECC_Y1_16</displayName>
          <description>ECC the Y-coordinate Word16 of the First Point</description>
          <addressOffset>0x90</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_17</name>
          <displayName>CRYPTO_ECC_Y1_17</displayName>
          <description>ECC the Y-coordinate Word17 of the First Point</description>
          <addressOffset>0x94</addressOffset>
       </register>
       <register>
          <name>CRYPTO_ECC_X2_00</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_X2_00</displayName>
          <description>ECC the X-coordinate Word0 of the Second Point</description>
          <addressOffset>0x98</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>POINTX2</name>
              <description>ECC the X-coordinate Value of the Second Point \nFor B-163 or K-163, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_05\nFor B-233 or K-233, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_07\nFor B-283 or K-283, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_08\nFor B-409 or K-409, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_12\nFor B-571 or K-571, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_17\nFor P-192, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_05\nFor P-224, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_06\nFor P-256, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_07\nFor P-384, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_11\nFor P-521, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_01</name>
          <displayName>CRYPTO_ECC_X2_01</displayName>
          <description>ECC the X-coordinate Word1 of the Second Point</description>
          <addressOffset>0x9C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_02</name>
          <displayName>CRYPTO_ECC_X2_02</displayName>
          <description>ECC the X-coordinate Word2 of the Second Point</description>
          <addressOffset>0xA0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_03</name>
          <displayName>CRYPTO_ECC_X2_03</displayName>
          <description>ECC the X-coordinate Word3 of the Second Point</description>
          <addressOffset>0xA4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_04</name>
          <displayName>CRYPTO_ECC_X2_04</displayName>
          <description>ECC the X-coordinate Word4 of the Second Point</description>
          <addressOffset>0xA8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_05</name>
          <displayName>CRYPTO_ECC_X2_05</displayName>
          <description>ECC the X-coordinate Word5 of the Second Point</description>
          <addressOffset>0xAC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_06</name>
          <displayName>CRYPTO_ECC_X2_06</displayName>
          <description>ECC the X-coordinate Word6 of the Second Point</description>
          <addressOffset>0xB0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_07</name>
          <displayName>CRYPTO_ECC_X2_07</displayName>
          <description>ECC the X-coordinate Word7 of the Second Point</description>
          <addressOffset>0xB4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_08</name>
          <displayName>CRYPTO_ECC_X2_08</displayName>
          <description>ECC the X-coordinate Word8 of the Second Point</description>
          <addressOffset>0xB8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_09</name>
          <displayName>CRYPTO_ECC_X2_09</displayName>
          <description>ECC the X-coordinate Word9 of the Second Point</description>
          <addressOffset>0xBC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_10</name>
          <displayName>CRYPTO_ECC_X2_10</displayName>
          <description>ECC the X-coordinate Word10 of the Second Point</description>
          <addressOffset>0xC0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_11</name>
          <displayName>CRYPTO_ECC_X2_11</displayName>
          <description>ECC the X-coordinate Word11 of the Second Point</description>
          <addressOffset>0xC4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_12</name>
          <displayName>CRYPTO_ECC_X2_12</displayName>
          <description>ECC the X-coordinate Word12 of the Second Point</description>
          <addressOffset>0xC8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_13</name>
          <displayName>CRYPTO_ECC_X2_13</displayName>
          <description>ECC the X-coordinate Word13 of the Second Point</description>
          <addressOffset>0xCC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_14</name>
          <displayName>CRYPTO_ECC_X2_14</displayName>
          <description>ECC the X-coordinate Word14 of the Second Point</description>
          <addressOffset>0xD0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_15</name>
          <displayName>CRYPTO_ECC_X2_15</displayName>
          <description>ECC the X-coordinate Word15 of the Second Point</description>
          <addressOffset>0xD4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_16</name>
          <displayName>CRYPTO_ECC_X2_16</displayName>
          <description>ECC the X-coordinate Word16 of the Second Point</description>
          <addressOffset>0xD8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_17</name>
          <displayName>CRYPTO_ECC_X2_17</displayName>
          <description>ECC the X-coordinate Word17 of the Second Point</description>
          <addressOffset>0xDC</addressOffset>
       </register>
       <register>
          <name>CRYPTO_ECC_Y2_00</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_Y2_00</displayName>
          <description>ECC the Y-coordinate Word0 of the Second Point</description>
          <addressOffset>0xE0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>POINTY2</name>
              <description>ECC the Y-coordinate Value of the Second Point \nFor B-163 or K-163, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_05\nFor B-233 or K-233, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_07\nFor B-283 or K-283, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_08\nFor B-409 or K-409, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_12\nFor B-571 or K-571, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_17\nFor P-192, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_05\nFor P-224, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_06\nFor P-256, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_07\nFor P-384, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_11\nFor P-521, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_01</name>
          <displayName>CRYPTO_ECC_Y2_01</displayName>
          <description>ECC the Y-coordinate Word1 of the Second Point</description>
          <addressOffset>0xE4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_02</name>
          <displayName>CRYPTO_ECC_Y2_02</displayName>
          <description>ECC the Y-coordinate Word2 of the Second Point</description>
          <addressOffset>0xE8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_03</name>
          <displayName>CRYPTO_ECC_Y2_03</displayName>
          <description>ECC the Y-coordinate Word3 of the Second Point</description>
          <addressOffset>0xEC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_04</name>
          <displayName>CRYPTO_ECC_Y2_04</displayName>
          <description>ECC the Y-coordinate Word4 of the Second Point</description>
          <addressOffset>0xF0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_05</name>
          <displayName>CRYPTO_ECC_Y2_05</displayName>
          <description>ECC the Y-coordinate Word5 of the Second Point</description>
          <addressOffset>0xF4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_06</name>
          <displayName>CRYPTO_ECC_Y2_06</displayName>
          <description>ECC the Y-coordinate Word6 of the Second Point</description>
          <addressOffset>0xF8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_07</name>
          <displayName>CRYPTO_ECC_Y2_07</displayName>
          <description>ECC the Y-coordinate Word7 of the Second Point</description>
          <addressOffset>0xFC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_08</name>
          <displayName>CRYPTO_ECC_Y2_08</displayName>
          <description>ECC the Y-coordinate Word8 of the Second Point</description>
          <addressOffset>0x100</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_09</name>
          <displayName>CRYPTO_ECC_Y2_09</displayName>
          <description>ECC the Y-coordinate Word9 of the Second Point</description>
          <addressOffset>0x104</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_10</name>
          <displayName>CRYPTO_ECC_Y2_10</displayName>
          <description>ECC the Y-coordinate Word10 of the Second Point</description>
          <addressOffset>0x108</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_11</name>
          <displayName>CRYPTO_ECC_Y2_11</displayName>
          <description>ECC the Y-coordinate Word11 of the Second Point</description>
          <addressOffset>0x10C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_12</name>
          <displayName>CRYPTO_ECC_Y2_12</displayName>
          <description>ECC the Y-coordinate Word12 of the Second Point</description>
          <addressOffset>0x110</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_13</name>
          <displayName>CRYPTO_ECC_Y2_13</displayName>
          <description>ECC the Y-coordinate Word13 of the Second Point</description>
          <addressOffset>0x114</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_14</name>
          <displayName>CRYPTO_ECC_Y2_14</displayName>
          <description>ECC the Y-coordinate Word14 of the Second Point</description>
          <addressOffset>0x118</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_15</name>
          <displayName>CRYPTO_ECC_Y2_15</displayName>
          <description>ECC the Y-coordinate Word15 of the Second Point</description>
          <addressOffset>0x11C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_16</name>
          <displayName>CRYPTO_ECC_Y2_16</displayName>
          <description>ECC the Y-coordinate Word16 of the Second Point</description>
          <addressOffset>0x120</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_17</name>
          <displayName>CRYPTO_ECC_Y2_17</displayName>
          <description>ECC the Y-coordinate Word17 of the Second Point</description>
          <addressOffset>0x124</addressOffset>
       </register>
       <register>
          <name>CRYPTO_ECC_A_00</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_A_00</displayName>
          <description>ECC the Parameter CURVEA Word0 of Elliptic Curve</description>
          <addressOffset>0x128</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CURVEA</name>
              <description>ECC the Parameter CURVEA Value of Elliptic Curve \nFor B-163 or K-163, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_05\nFor B-233 or K-233, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_07\nFor B-283 or K-283, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_08\nFor B-409 or K-409, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_12\nFor B-571 or K-571, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_17\nFor P-192, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_05\nFor P-224, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_06\nFor P-256, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_07\nFor P-384, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_11\nFor P-521, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_01</name>
          <displayName>CRYPTO_ECC_A_01</displayName>
          <description>ECC the Parameter CURVEA Word1 of Elliptic Curve</description>
          <addressOffset>0x12C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_02</name>
          <displayName>CRYPTO_ECC_A_02</displayName>
          <description>ECC the Parameter CURVEA Word2 of Elliptic Curve</description>
          <addressOffset>0x130</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_03</name>
          <displayName>CRYPTO_ECC_A_03</displayName>
          <description>ECC the Parameter CURVEA Word3 of Elliptic Curve</description>
          <addressOffset>0x134</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_04</name>
          <displayName>CRYPTO_ECC_A_04</displayName>
          <description>ECC the Parameter CURVEA Word4 of Elliptic Curve</description>
          <addressOffset>0x138</addressOffset>
       </register>
