Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/M2354_v1.svd
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_05</name>
          <displayName>CRYPTO_ECC_A_05</displayName>
          <description>ECC the Parameter CURVEA Word5 of Elliptic Curve</description>
          <addressOffset>0x13C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_06</name>
          <displayName>CRYPTO_ECC_A_06</displayName>
          <description>ECC the Parameter CURVEA Word6 of Elliptic Curve</description>
          <addressOffset>0x140</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_07</name>
          <displayName>CRYPTO_ECC_A_07</displayName>
          <description>ECC the Parameter CURVEA Word7 of Elliptic Curve</description>
          <addressOffset>0x144</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_08</name>
          <displayName>CRYPTO_ECC_A_08</displayName>
          <description>ECC the Parameter CURVEA Word8 of Elliptic Curve</description>
          <addressOffset>0x148</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_09</name>
          <displayName>CRYPTO_ECC_A_09</displayName>
          <description>ECC the Parameter CURVEA Word9 of Elliptic Curve</description>
          <addressOffset>0x14C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_10</name>
          <displayName>CRYPTO_ECC_A_10</displayName>
          <description>ECC the Parameter CURVEA Word10 of Elliptic Curve</description>
          <addressOffset>0x150</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_11</name>
          <displayName>CRYPTO_ECC_A_11</displayName>
          <description>ECC the Parameter CURVEA Word11 of Elliptic Curve</description>
          <addressOffset>0x154</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_12</name>
          <displayName>CRYPTO_ECC_A_12</displayName>
          <description>ECC the Parameter CURVEA Word12 of Elliptic Curve</description>
          <addressOffset>0x158</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_13</name>
          <displayName>CRYPTO_ECC_A_13</displayName>
          <description>ECC the Parameter CURVEA Word13 of Elliptic Curve</description>
          <addressOffset>0x15C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_14</name>
          <displayName>CRYPTO_ECC_A_14</displayName>
          <description>ECC the Parameter CURVEA Word14 of Elliptic Curve</description>
          <addressOffset>0x160</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_15</name>
          <displayName>CRYPTO_ECC_A_15</displayName>
          <description>ECC the Parameter CURVEA Word15 of Elliptic Curve</description>
          <addressOffset>0x164</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_16</name>
          <displayName>CRYPTO_ECC_A_16</displayName>
          <description>ECC the Parameter CURVEA Word16 of Elliptic Curve</description>
          <addressOffset>0x168</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_17</name>
          <displayName>CRYPTO_ECC_A_17</displayName>
          <description>ECC the Parameter CURVEA Word17 of Elliptic Curve</description>
          <addressOffset>0x16C</addressOffset>
       </register>
       <register>
          <name>CRYPTO_ECC_B_00</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_B_00</displayName>
          <description>ECC the Parameter CURVEB Word0 of Elliptic Curve</description>
          <addressOffset>0x170</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CURVEB</name>
              <description>ECC the Parameter CURVEB Value of Elliptic Curve \nFor B-163 or K-163, CURVEB is stored in CRYPTO_ECC_B_00~CRYPTO_ECC_B_05\nFor B-233 or K-233, CURVEB is stored in CRYPTO_ECC_B_00~CRYPTO_ECC_B_07\nFor B-283 or K-283, CURVEB is stored in CRYPTO_ECC_B_00~CRYPTO_ECC_B_08\nFor B-409 or K-409, CURVEB is stored in CRYPTO_ECC_B_00~CRYPTO_ECC_B_12\nFor B-521 or K-521, CURVEB is stored in CRYPTO_ECC_B_00~CRYPTO_ECC_B_17\nFor P-192, CURVEB is stored in CRYPTO_ECC_B_00~CRYPTO_ECC_B_05\nFor P-224, CURVEB is stored in CRYPTO_ECC_B_00~CRYPTO_ECC_B_06\nFor P-256, CURVEB is stored in CRYPTO_ECC_B_00~CRYPTO_ECC_B_07\nFor P-384, CURVEB is stored in CRYPTO_ECC_B_00~CRYPTO_ECC_B_11\nFor P-521, CURVEB is stored in CRYPTO_ECC_B_00~CRYPTO_ECC_B_16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_01</name>
          <displayName>CRYPTO_ECC_B_01</displayName>
          <description>ECC the Parameter CURVEB Word1 of Elliptic Curve</description>
          <addressOffset>0x174</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_02</name>
          <displayName>CRYPTO_ECC_B_02</displayName>
          <description>ECC the Parameter CURVEB Word2 of Elliptic Curve</description>
          <addressOffset>0x178</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_03</name>
          <displayName>CRYPTO_ECC_B_03</displayName>
          <description>ECC the Parameter CURVEB Word3 of Elliptic Curve</description>
          <addressOffset>0x17C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_04</name>
          <displayName>CRYPTO_ECC_B_04</displayName>
          <description>ECC the Parameter CURVEB Word4 of Elliptic Curve</description>
          <addressOffset>0x180</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_05</name>
          <displayName>CRYPTO_ECC_B_05</displayName>
          <description>ECC the Parameter CURVEB Word5 of Elliptic Curve</description>
          <addressOffset>0x184</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_06</name>
          <displayName>CRYPTO_ECC_B_06</displayName>
          <description>ECC the Parameter CURVEB Word6 of Elliptic Curve</description>
          <addressOffset>0x188</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_07</name>
          <displayName>CRYPTO_ECC_B_07</displayName>
          <description>ECC the Parameter CURVEB Word7 of Elliptic Curve</description>
          <addressOffset>0x18C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_08</name>
          <displayName>CRYPTO_ECC_B_08</displayName>
          <description>ECC the Parameter CURVEB Word8 of Elliptic Curve</description>
          <addressOffset>0x190</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_09</name>
          <displayName>CRYPTO_ECC_B_09</displayName>
          <description>ECC the Parameter CURVEB Word9 of Elliptic Curve</description>
          <addressOffset>0x194</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_10</name>
          <displayName>CRYPTO_ECC_B_10</displayName>
          <description>ECC the Parameter CURVEB Word10 of Elliptic Curve</description>
          <addressOffset>0x198</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_11</name>
          <displayName>CRYPTO_ECC_B_11</displayName>
          <description>ECC the Parameter CURVEB Word11 of Elliptic Curve</description>
          <addressOffset>0x19C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_12</name>
          <displayName>CRYPTO_ECC_B_12</displayName>
          <description>ECC the Parameter CURVEB Word12 of Elliptic Curve</description>
          <addressOffset>0x1A0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_13</name>
          <displayName>CRYPTO_ECC_B_13</displayName>
          <description>ECC the Parameter CURVEB Word13 of Elliptic Curve</description>
          <addressOffset>0x1A4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_14</name>
          <displayName>CRYPTO_ECC_B_14</displayName>
          <description>ECC the Parameter CURVEB Word14 of Elliptic Curve</description>
          <addressOffset>0x1A8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_15</name>
          <displayName>CRYPTO_ECC_B_15</displayName>
          <description>ECC the Parameter CURVEB Word15 of Elliptic Curve</description>
          <addressOffset>0x1AC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_16</name>
          <displayName>CRYPTO_ECC_B_16</displayName>
          <description>ECC the Parameter CURVEB Word16 of Elliptic Curve</description>
          <addressOffset>0x1B0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_17</name>
          <displayName>CRYPTO_ECC_B_17</displayName>
          <description>ECC the Parameter CURVEB Word17 of Elliptic Curve</description>
          <addressOffset>0x1B4</addressOffset>
       </register>
       <register>
          <name>CRYPTO_ECC_N_00</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_N_00</displayName>
          <description>ECC the Parameter CURVEN Word0 of Elliptic Curve</description>
          <addressOffset>0x1B8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CURVEN</name>
              <description>ECC the Parameter CURVEN Value of Elliptic Curve \nIn GF(p), CURVEN is the prime p.\nIn GF(2m), CURVEN is  the irreducible polynomial.\nFor B-163 or K-163, CURVEN is stored in CRYPTO_ECC_N_00~CRYPTO_ECC_N_05\nFor B-233 or K-233, CURVEN is stored in CRYPTO_ECC_N_00~CRYPTO_ECC_N_07\nFor B-283 or K-283, CURVEN is stored in CRYPTO_ECC_N_00~CRYPTO_ECC_N_08\nFor B-409 or K-409, CURVEN is stored in CRYPTO_ECC_N_00~CRYPTO_ECC_N_12\nFor B-571 or K-571, CURVEN is stored in CRYPTO_ECC_N_00~CRYPTO_ECC_N_17\nFor P-192, CURVEN is stored in CRYPTO_ECC_N_00~CRYPTO_ECC_N_05\nFor P-224, CURVEN is stored in CRYPTO_ECC_N_00~CRYPTO_ECC_N_06\nFor P-256, CURVEN is stored in CRYPTO_ECC_N_00~CRYPTO_ECC_N_07\nFor P-384, CURVEN is stored in CRYPTO_ECC_N_00~CRYPTO_ECC_N_11\nFor P-521, CURVEN is stored in CRYPTO_ECC_N_00~CRYPTO_ECC_N_16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_01</name>
          <displayName>CRYPTO_ECC_N_01</displayName>
          <description>ECC the Parameter CURVEN Word1 of Elliptic Curve</description>
          <addressOffset>0x1BC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_02</name>
          <displayName>CRYPTO_ECC_N_02</displayName>
          <description>ECC the Parameter CURVEN Word2 of Elliptic Curve</description>
          <addressOffset>0x1C0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_03</name>
          <displayName>CRYPTO_ECC_N_03</displayName>
          <description>ECC the Parameter CURVEN Word3 of Elliptic Curve</description>
          <addressOffset>0x1C4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_04</name>
          <displayName>CRYPTO_ECC_N_04</displayName>
          <description>ECC the Parameter CURVEN Word4 of Elliptic Curve</description>
          <addressOffset>0x1C8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_05</name>
          <displayName>CRYPTO_ECC_N_05</displayName>
          <description>ECC the Parameter CURVEN Word5 of Elliptic Curve</description>
          <addressOffset>0x1CC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_06</name>
          <displayName>CRYPTO_ECC_N_06</displayName>
          <description>ECC the Parameter CURVEN Word6 of Elliptic Curve</description>
          <addressOffset>0x1D0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_07</name>
          <displayName>CRYPTO_ECC_N_07</displayName>
          <description>ECC the Parameter CURVEN Word7 of Elliptic Curve</description>
          <addressOffset>0x1D4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_08</name>
          <displayName>CRYPTO_ECC_N_08</displayName>
          <description>ECC the Parameter CURVEN Word8 of Elliptic Curve</description>
          <addressOffset>0x1D8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_09</name>
          <displayName>CRYPTO_ECC_N_09</displayName>
          <description>ECC the Parameter CURVEN Word9 of Elliptic Curve</description>
          <addressOffset>0x1DC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_10</name>
          <displayName>CRYPTO_ECC_N_10</displayName>
          <description>ECC the Parameter CURVEN Word10 of Elliptic Curve</description>
          <addressOffset>0x1E0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_11</name>
          <displayName>CRYPTO_ECC_N_11</displayName>
          <description>ECC the Parameter CURVEN Word11 of Elliptic Curve</description>
          <addressOffset>0x1E4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_12</name>
          <displayName>CRYPTO_ECC_N_12</displayName>
          <description>ECC the Parameter CURVEN Word12 of Elliptic Curve</description>
          <addressOffset>0x1E8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_13</name>
          <displayName>CRYPTO_ECC_N_13</displayName>
          <description>ECC the Parameter CURVEN Word13 of Elliptic Curve</description>
          <addressOffset>0x1EC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_14</name>
          <displayName>CRYPTO_ECC_N_14</displayName>
          <description>ECC the Parameter CURVEN Word14 of Elliptic Curve</description>
          <addressOffset>0x1F0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_15</name>
          <displayName>CRYPTO_ECC_N_15</displayName>
          <description>ECC the Parameter CURVEN Word15 of Elliptic Curve</description>
          <addressOffset>0x1F4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_16</name>
          <displayName>CRYPTO_ECC_N_16</displayName>
          <description>ECC the Parameter CURVEN Word16 of Elliptic Curve</description>
          <addressOffset>0x1F8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_17</name>
          <displayName>CRYPTO_ECC_N_17</displayName>
          <description>ECC the Parameter CURVEN Word17 of Elliptic Curve</description>
          <addressOffset>0x1FC</addressOffset>
       </register>
       <register>
          <name>CRYPTO_ECC_K_00</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_K_00</displayName>
          <description>ECC the Scalar SCALARK Word0 of Point Multiplication</description>
          <addressOffset>0x200</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCALARK</name>
              <description>ECC the Scalar SCALARK Value of Point Multiplication\nBecause the SCALARK usually stores the private key, ECC accelerator do not allow to read the register SCALARK.\nFor B-163 or K-163, SCALARK is stored in CRYPTO_ECC_K_00~CRYPTO_ECC_K_05\nFor B-233 or K-233, SCALARK is stored in CRYPTO_ECC_K_00~CRYPTO_ECC_K_07\nFor B-283 or K-283, SCALARK is stored in CRYPTO_ECC_K_00~CRYPTO_ECC_K_08\nFor B-409 or K-409, SCALARK is stored in CRYPTO_ECC_K_00~CRYPTO_ECC_K_12\nFor B-571 or K-571, SCALARK is stored in CRYPTO_ECC_K_00~CRYPTO_ECC_K_17\nFor P-192, SCALARK is stored in CRYPTO_ECC_K_00~CRYPTO_ECC_K_05\nFor P-224, SCALARK is stored in CRYPTO_ECC_K_00~CRYPTO_ECC_K_06\nFor P-256, SCALARK is stored in CRYPTO_ECC_K_00~CRYPTO_ECC_K_07\nFor P-384, SCALARK is stored in CRYPTO_ECC_K_00~CRYPTO_ECC_K_11\nFor P-521, SCALARK is stored in CRYPTO_ECC_K_00~CRYPTO_ECC_K_16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_01</name>
          <displayName>CRYPTO_ECC_K_01</displayName>
          <description>ECC the Scalar SCALARK Word1 of Point Multiplication</description>
          <addressOffset>0x204</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_02</name>
          <displayName>CRYPTO_ECC_K_02</displayName>
          <description>ECC the Scalar SCALARK Word2 of Point Multiplication</description>
          <addressOffset>0x208</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_03</name>
          <displayName>CRYPTO_ECC_K_03</displayName>
          <description>ECC the Scalar SCALARK Word3 of Point Multiplication</description>
          <addressOffset>0x20C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_04</name>
          <displayName>CRYPTO_ECC_K_04</displayName>
          <description>ECC the Scalar SCALARK Word4 of Point Multiplication</description>
          <addressOffset>0x210</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_05</name>
          <displayName>CRYPTO_ECC_K_05</displayName>
          <description>ECC the Scalar SCALARK Word5 of Point Multiplication</description>
          <addressOffset>0x214</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_06</name>
          <displayName>CRYPTO_ECC_K_06</displayName>
          <description>ECC the Scalar SCALARK Word6 of Point Multiplication</description>
          <addressOffset>0x218</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_07</name>
          <displayName>CRYPTO_ECC_K_07</displayName>
          <description>ECC the Scalar SCALARK Word7 of Point Multiplication</description>
          <addressOffset>0x21C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_08</name>
          <displayName>CRYPTO_ECC_K_08</displayName>
          <description>ECC the Scalar SCALARK Word8 of Point Multiplication</description>
          <addressOffset>0x220</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_09</name>
          <displayName>CRYPTO_ECC_K_09</displayName>
          <description>ECC the Scalar SCALARK Word9 of Point Multiplication</description>
          <addressOffset>0x224</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_10</name>
          <displayName>CRYPTO_ECC_K_10</displayName>
          <description>ECC the Scalar SCALARK Word10 of Point Multiplication</description>
          <addressOffset>0x228</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_11</name>
          <displayName>CRYPTO_ECC_K_11</displayName>
          <description>ECC the Scalar SCALARK Word11 of Point Multiplication</description>
          <addressOffset>0x22C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_12</name>
          <displayName>CRYPTO_ECC_K_12</displayName>
          <description>ECC the Scalar SCALARK Word12 of Point Multiplication</description>
          <addressOffset>0x230</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_13</name>
          <displayName>CRYPTO_ECC_K_13</displayName>
          <description>ECC the Scalar SCALARK Word13 of Point Multiplication</description>
          <addressOffset>0x234</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_14</name>
          <displayName>CRYPTO_ECC_K_14</displayName>
          <description>ECC the Scalar SCALARK Word14 of Point Multiplication</description>
          <addressOffset>0x238</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_15</name>
          <displayName>CRYPTO_ECC_K_15</displayName>
          <description>ECC the Scalar SCALARK Word15 of Point Multiplication</description>
          <addressOffset>0x23C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_16</name>
          <displayName>CRYPTO_ECC_K_16</displayName>
          <description>ECC the Scalar SCALARK Word16 of Point Multiplication</description>
          <addressOffset>0x240</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_17</name>
          <displayName>CRYPTO_ECC_K_17</displayName>
          <description>ECC the Scalar SCALARK Word17 of Point Multiplication</description>
          <addressOffset>0x244</addressOffset>
       </register>
