Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/M2354_v1.svd
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK50</name>
          <displayName>CRYPTO_HMAC_FDBCK50</displayName>
          <description>SHA/HMAC Output Feedback Data 50 After SHA/HMAC Operation</description>
          <addressOffset>0x120</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK51</name>
          <displayName>CRYPTO_HMAC_FDBCK51</displayName>
          <description>SHA/HMAC Output Feedback Data 51 After SHA/HMAC Operation</description>
          <addressOffset>0x124</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK52</name>
          <displayName>CRYPTO_HMAC_FDBCK52</displayName>
          <description>SHA/HMAC Output Feedback Data 52 After SHA/HMAC Operation</description>
          <addressOffset>0x128</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_FDBCK0">
          <name>CRYPTO_HMAC_FDBCK53</name>
          <displayName>CRYPTO_HMAC_FDBCK53</displayName>
          <description>SHA/HMAC Output Feedback Data 53 After SHA/HMAC Operation</description>
          <addressOffset>0x12C</addressOffset>
       </register>
       <register>
          <name>CRYPTO_HMAC_FBADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_HMAC_FBADDR</displayName>
          <description>SHA/HMAC DMA Feedback Address Register</description>
          <addressOffset>0x1FC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FBADDR</name>
              <description>SHA/HMAC DMA Feedback Address\nIn DMA cascade mode, software can update DMA feedback address register for automatically reading and writing feedback values via DMA.The FBADDR keeps the feedback address of the feedback data for the next cascade operation. Based on the feedback address, the SHA/HMAC accelerator can read thefeedback data of the last cascade opeation from SRAM memory space and write thefeedback data of the current cascade opeation to SRAM memory space. The start of feedback address should be located at word boundary. In other words, bit 1 and 0 of FBADDR are ignored.\nFBADDR can be read and written.\nIn DMA mode, software can update the next CRYPTO_HMAC_FBADDR before triggering START.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_HMAC_KSCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_HMAC_KSCTL</displayName>
          <description>HMAC Key Control Register</description>
          <addressOffset>0xC30</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NUM</name>
              <description>Read Key Number\nThe key number is sent to key store</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RSRC</name>
              <description>Read Key Source</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Key is read from HMAC registers</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Key is read from key store</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
            <field>
              <name>RSSRC</name>
              <description>Read Key Store Source</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Key is read from the SRAM of key store</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Key is read from the OTP of key store</description>
                    <value>#10</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
          </fields>
       </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PRNG_NS</name>
      <description>CRYPTO Register Map</description>
      <groupName>CRYPTO</groupName>
      <baseAddress>0x50032008</baseAddress>
      <!-- d -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xEF8</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>CRYPTO_PRNG_CTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_PRNG_CTL</displayName>
          <description>PRNG Control Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>START</name>
              <description>Start PRNG Engine</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Stop PRNG engine</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Generate new key and store the new key to register CRYPTO_PRNG_KEYx, which will be cleared when the new key is generated</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SEEDRLD</name>
              <description>Reload New Seed for PRNG Engine</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Generating key based on the current seed</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reload new seed</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>KEYSZ</name>
              <description>PRNG Generate Key Size\nNote: 283~571 bits are only generated for Key Store.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>128 bits</description>
                    <value>#0000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>163 bits</description>
                    <value>#0001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>192 bits</description>
                    <value>#0010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>224 bits</description>
                    <value>#0011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>233 bits</description>
                    <value>#0100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>255 bits</description>
                    <value>#0101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>256 bits</description>
                    <value>#0110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>283 bits (only for KS)</description>
                    <value>#0111</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>8</name>
                    <description>384 bits (only for KS)</description>
                    <value>#1000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>9</name>
                    <description>409 bits (only for KS)</description>
                    <value>#1001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>512 bits (only for KS)</description>
                    <value>#1010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>11</name>
                    <description>521 bits (only for KS)</description>
                    <value>#1011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>12</name>
                    <description>571 bits (only for KS)</description>
                    <value>#1100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>13</name>
                    <description>Reserved.</description>
                    <value>#1101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>14</name>
                    <description>Reserved.</description>
                    <value>#1110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>15</name>
                    <description>Reserved.</description>
                    <value>#1111</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SEEDSEL</name>
              <description>Seed Select\nThis bit can be set to 1 only after SEEDRDY (TRNG_CTL[9]) bit become to 1.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Select the seed which is from PRNG</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Select the seed which is from TRNG (not from CRYPTO_PRNG_SEED)</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SEEDSRC</name>
              <description>Seed Source (Read Only)\nNote: This bit is cleared to '0' when SEEDSEL is 0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Seed is from PRNG</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Seed is from TRNG. (not from CRYPTO_PRNG_SEED)</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>PRNG Busy (Read Only)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PRNG engine is idle</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Indicate that the PRNG engine is generating CRYPTO_PRNG_KEYx</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_PRNG_SEED</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_PRNG_SEED</displayName>
          <description>Seed for PRNG</description>
          <addressOffset>0x4</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>SEED</name>
              <description>Seed for PRNG (Write Only)\nThe bits store the seed for PRNG engine.\nNote: In TRNG+PRNG mode, the seed is from TRNG engine, and it will not be stored in this register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_PRNG_KEY0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_PRNG_KEY0</displayName>
          <description>PRNG Generated Key0</description>
          <addressOffset>0x8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY</name>
              <description>Store PRNG Generated Key (Read Only)\nThe bits store the key that is generated by PRNG.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_PRNG_KEY0">
          <name>CRYPTO_PRNG_KEY1</name>
          <displayName>CRYPTO_PRNG_KEY1</displayName>
          <description>PRNG Generated Key1</description>
          <addressOffset>0xC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_PRNG_KEY0">
          <name>CRYPTO_PRNG_KEY2</name>
          <displayName>CRYPTO_PRNG_KEY2</displayName>
          <description>PRNG Generated Key2</description>
          <addressOffset>0x10</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_PRNG_KEY0">
          <name>CRYPTO_PRNG_KEY3</name>
          <displayName>CRYPTO_PRNG_KEY3</displayName>
          <description>PRNG Generated Key3</description>
          <addressOffset>0x14</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_PRNG_KEY0">
          <name>CRYPTO_PRNG_KEY4</name>
          <displayName>CRYPTO_PRNG_KEY4</displayName>
          <description>PRNG Generated Key4</description>
          <addressOffset>0x18</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_PRNG_KEY0">
          <name>CRYPTO_PRNG_KEY5</name>
          <displayName>CRYPTO_PRNG_KEY5</displayName>
          <description>PRNG Generated Key5</description>
          <addressOffset>0x1C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_PRNG_KEY0">
          <name>CRYPTO_PRNG_KEY6</name>
          <displayName>CRYPTO_PRNG_KEY6</displayName>
          <description>PRNG Generated Key6</description>
          <addressOffset>0x20</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_PRNG_KEY0">
          <name>CRYPTO_PRNG_KEY7</name>
          <displayName>CRYPTO_PRNG_KEY7</displayName>
          <description>PRNG Generated Key7</description>
          <addressOffset>0x24</addressOffset>
       </register>
       <register>
          <name>CRYPTO_PRNG_STS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_PRNG_STS</displayName>
          <description>PRNG Status Register</description>
          <addressOffset>0x28</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BUSY</name>
              <description>PRNG Busy Flag </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PRNG engine is idle</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Indicate that the PRNG engine is generating CRYPTO_PRNG_KEYx</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>KCTLERR</name>
              <description>PRNG Key Control Register Error Flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PRNG key control error. When PRNG execute ECDSA or ECDH, but PRNG seed not from TRNG or key is not written to the SRAM of key store (WSDST, CRYPTO_PRNG_KSCTL[23:22] is not equal to '00')</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>KSERR</name>
              <description>PRNG Access Key Store Error Flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Access key store fail</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
