Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/M2354_v1.svd
       <register>
          <name>EADC_SCTL0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADC_SCTL0</displayName>
          <description>ADC Sample Module 0 Control Register</description>
          <addressOffset>0x80</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHSEL</name>
              <description>ADC Sample Module Channel Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTREN</name>
              <description>ADC External Trigger Rising Edge Enable Bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Rising edge Disabled when ADC selects EADC0_ST as trigger source</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Rising edge Enabled when ADC selects EADC0_ST as trigger source</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTFEN</name>
              <description>ADC External Trigger Falling Edge Enable Bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Falling edge Disabled when ADC selects EADC0_ST as trigger source</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Falling edge Enabled when ADC selects EADC0_ST as trigger source</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGDLYDIV</name>
              <description>ADC Sample Module Start of Conversion Trigger Delay Clock Divider Selection\nTrigger delay clock frequency: </description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>ADC_CLK/1</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>ADC_CLK/2</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>ADC_CLK/4</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>ADC_CLK/16</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGDLYCNT</name>
              <description>ADC Sample Module Start of Conversion Trigger Delay Time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGSEL</name>
              <description>ADC Sample Module Start of Conversion Trigger Source Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTPOS</name>
              <description>Interrupt Flag Position Select</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Set ADIFn (EADC_STATUS2[n], n=0~3) at ADC end of conversion</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Set ADIFn (EADC_STATUS2[n], n=0~3) at ADC start of conversion</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DBMEN</name>
              <description>Double Buffer Mode Enable Bit</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Sample has one sample result register (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Sample has two sample result registers</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTSMPT</name>
              <description>ADC Sampling Time Extend\nWhen ADC converting at high conversion rate, the sampling time of analog input voltage may not enough if input channel loading is heavy, user can extend ADC sampling time after trigger source is coming to get enough sampling time.\nThe range of start delay time is from 0~255 ADC clock.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EADC_SCTL0">
          <name>EADC_SCTL1</name>
          <displayName>EADC_SCTL1</displayName>
          <description>ADC Sample Module 1 Control Register</description>
          <addressOffset>0x84</addressOffset>
       </register>
       <register derivedFrom="EADC_SCTL0">
          <name>EADC_SCTL2</name>
          <displayName>EADC_SCTL2</displayName>
          <description>ADC Sample Module 2 Control Register</description>
          <addressOffset>0x88</addressOffset>
       </register>
       <register derivedFrom="EADC_SCTL0">
          <name>EADC_SCTL3</name>
          <displayName>EADC_SCTL3</displayName>
          <description>ADC Sample Module 3 Control Register</description>
          <addressOffset>0x8C</addressOffset>
       </register>
       <register>
          <name>EADC_SCTL4</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADC_SCTL4</displayName>
          <description>ADC Sample Module 4 Control Register</description>
          <addressOffset>0x90</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHSEL</name>
              <description>ADC Sample Module Channel Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTREN</name>
              <description>ADC External Trigger Rising Edge Enable Bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Rising edge Disabled when ADC selects EADC0_ST as trigger source</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Rising edge Enabled when ADC selects EADC0_ST as trigger source</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTFEN</name>
              <description>ADC External Trigger Falling Edge Enable Bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Falling edge Disabled when ADC selects EADC0_ST as trigger source</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Falling edge Enabled when ADC selects EADC0_ST as trigger source</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGDLYDIV</name>
              <description>ADC Sample Module Start of Conversion Trigger Delay Clock Divider Selection\nTrigger delay clock frequency:</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>ADC_CLK/1</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>ADC_CLK/2</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>ADC_CLK/4</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>ADC_CLK/16</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGDLYCNT</name>
              <description>ADC Sample Module Start of Conversion Trigger Delay Time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGSEL</name>
              <description>ADC Sample Module Start of Conversion Trigger Source Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTPOS</name>
              <description>Interrupt Flag Position Select</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Set ADIFn (EADC_STATUS2[n], n=0~3) at ADC end of conversion</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Set ADIFn (EADC_STATUS2[n], n=0~3) at ADC start of conversion</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTSMPT</name>
              <description>ADC Sampling Time Extend\nWhen ADC converting at high conversion rate, the sampling time of analog input voltage may not enough if input channel loading is heavy, SW can extend ADC sampling time after trigger source is coming to get enough sampling time.\nThe range of start delay time is from 0~255 ADC clock.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EADC_SCTL4">
          <name>EADC_SCTL5</name>
          <displayName>EADC_SCTL5</displayName>
          <description>ADC Sample Module 5 Control Register</description>
          <addressOffset>0x94</addressOffset>
       </register>
       <register derivedFrom="EADC_SCTL4">
          <name>EADC_SCTL6</name>
          <displayName>EADC_SCTL6</displayName>
          <description>ADC Sample Module 6 Control Register</description>
          <addressOffset>0x98</addressOffset>
       </register>
       <register derivedFrom="EADC_SCTL4">
          <name>EADC_SCTL7</name>
          <displayName>EADC_SCTL7</displayName>
          <description>ADC Sample Module 7 Control Register</description>
          <addressOffset>0x9C</addressOffset>
       </register>
       <register derivedFrom="EADC_SCTL4">
          <name>EADC_SCTL8</name>
          <displayName>EADC_SCTL8</displayName>
          <description>ADC Sample Module 8 Control Register</description>
          <addressOffset>0xA0</addressOffset>
       </register>
       <register derivedFrom="EADC_SCTL4">
          <name>EADC_SCTL9</name>
          <displayName>EADC_SCTL9</displayName>
          <description>ADC Sample Module 9 Control Register</description>
          <addressOffset>0xA4</addressOffset>
       </register>
       <register derivedFrom="EADC_SCTL4">
          <name>EADC_SCTL10</name>
          <displayName>EADC_SCTL10</displayName>
          <description>ADC Sample Module 10 Control Register</description>
          <addressOffset>0xA8</addressOffset>
       </register>
       <register derivedFrom="EADC_SCTL4">
          <name>EADC_SCTL11</name>
          <displayName>EADC_SCTL11</displayName>
          <description>ADC Sample Module 11 Control Register</description>
          <addressOffset>0xAC</addressOffset>
       </register>
       <register derivedFrom="EADC_SCTL4">
          <name>EADC_SCTL12</name>
          <displayName>EADC_SCTL12</displayName>
          <description>ADC Sample Module 12 Control Register</description>
          <addressOffset>0xB0</addressOffset>
       </register>
       <register derivedFrom="EADC_SCTL4">
          <name>EADC_SCTL13</name>
          <displayName>EADC_SCTL13</displayName>
          <description>ADC Sample Module 13 Control Register</description>
          <addressOffset>0xB4</addressOffset>
       </register>
       <register derivedFrom="EADC_SCTL4">
          <name>EADC_SCTL14</name>
          <displayName>EADC_SCTL14</displayName>
          <description>ADC Sample Module 14 Control Register</description>
          <addressOffset>0xB8</addressOffset>
       </register>
       <register derivedFrom="EADC_SCTL4">
          <name>EADC_SCTL15</name>
          <displayName>EADC_SCTL15</displayName>
          <description>ADC Sample Module 15 Control Register</description>
          <addressOffset>0xBC</addressOffset>
       </register>
       <register>
          <name>EADC_SCTL16</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADC_SCTL16</displayName>
          <description>ADC Sample Module 16 Control Register</description>
          <addressOffset>0xC0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EXTSMPT</name>
              <description>ADC Sampling Time Extend\nWhen ADC converting at high conversion rate, the sampling time of analog input voltage may not enough if input channel loading is heavy, SW can extend ADC sampling time after trigger source is coming to get enough sampling time.\nThe range of start delay time is from 0~255 ADC clock.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
